emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Disassemble.c
/*
 * Copyright (c)      2016 eSOL TRINITY, www.esol-trinity.co.jp
 * Copyright (c) 2005-2021 Imperas Software Ltd., www.imperas.com
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
 * either express or implied.
 *
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

// standard includes
#include <stdio.h>
#include <string.h>                // strcpy, strstr

// VMI header files
#include "vmi/vmiCxt.h"

// model header files
#include "rl78Decode.h"
#include "rl78Functions.h"
#include "rl78Structure.h"        // R_A
#include "rl78Utils.h"            // snprint_hex
#include "rl78Message.h"        // MY_ASSERT

static void        fillInstructionBytes(rl78P rl78, Uns32 n, Uns32 thisPC, char *buf);
static const char* skipPrefix(rl78P rl78);

static const char* REGNAME_H[4] = { "AX", "BC", "DE", "HL" };
static const char* REGNAME_B[8] = { "X", "A", "C", "B", "E", "D", "L", "H" };

static char hex[32 + 1];

#define UNUSED   __attribute__((unused))

#define    PRE()    \
    UNUSED Uns32    cur = rl78->len_instPrefix + rl78->len_instMnem;    \
    UNUSED Uns32    op1 = 0;    /* operand in instruction bytes */        \
    UNUSED Uns32    op2 = 0;    /* operand in instruction bytes */        \
    UNUSED Uns32    ix1 = 0;    /* bit number of processing */            \
    UNUSED Uns32    dis = 0;    /* displacement */                        \
    UNUSED Uns32    dmy = 0;                                            \
    fillInstructionBytes(rl78, 32, thisPC, hex);


#define IMM1(opx)        /* 1 means 1 byte fetch */                \
    MY_ASSERT((cur < rl78->len_instByte), "IMM1");                \
    opx = instr[cur];                                            \
    cur += 1;

#define IMM2(opx)        /* 2 means 2 bytes fetch */                \
    MY_ASSERT(((cur + 1) < rl78->len_instByte), "IMM2");        \
    opx = instr[cur] + (instr[cur + 1] << 8);                    \
    cur += 2;

#define IMM3(opx)        /* 3 means 3 bytes fetch */                \
    MY_ASSERT(((cur + 2) < rl78->len_instByte), "IMM3");        \
    opx = instr[cur] + (instr[cur + 1] << 8) + (instr[cur + 2] << 16);    \
    cur += 3;

#define GETBIT(lsb, len)    ( (instr[cur - 1] >> lsb) & ((1 << len) - 1) )

#define IDX3(idx)        /* 3 means decode 3 bits */                \
    idx = GETBIT(4, 3);

#define IDX4(idx)        /* 4 means decode 4 bits */                \
    idx = GETBIT(4, 4);

#define BIT3(opx)        /* 3 means decode 3 bits */                \
    opx = GETBIT(0, 3);

#define BIT2(opx)        /* 2 means decode 2 bits */                \
    opx = GETBIT(1, 2);

#define BIT(opx, lsb, len)                                        \
    opx = GETBIT(lsb, len);


// address adjustment
#define    SADDR(opx)                    IMM1(opx); opx += (opx < 0x20) ? 0xFFF00 : 0xFFE00;        // FFE20h-FFF1Fh
#define    SFR(opx)                    IMM1(opx); opx += 0xFFF00;
#define    DMY1(opx)                    IMM1(opx);


static inline       char* t_abs20(Uns32 val) { static char buf_abs20[16]; sprintf(buf_abs20, "!!0x%05x", val); return buf_abs20; }
static inline       char* t_abs16(Uns32 val) { static char buf_abs16[16]; sprintf(buf_abs16, "!0x%05x" , val); return buf_abs16; }
static inline       char* t_adr8 (Uns32 val) { static char buf_adr8 [16]; sprintf(buf_adr8 , "0x%05x"  , val); return buf_adr8 ; }
static inline       char* t_rel16(Uns32 val) { static char buf_rel16[16]; sprintf(buf_rel16, "$!0x%04x", val); return buf_rel16; }
static inline       char* t_rel8 (Uns32 val) { static char buf_rel8 [16]; sprintf(buf_rel8 , "$0x%02x" , val); return buf_rel8 ; }
static inline       char* t_imm16(Uns32 val) { static char buf_imm16[16]; sprintf(buf_imm16, "#0x%04x" , val); return buf_imm16; }
static inline       char* t_imm8 (Uns32 val) { static char buf_imm8 [16]; sprintf(buf_imm8 , "#0x%02x" , val); return buf_imm8 ; }
static inline       char* t_dis16(Uns32 val) { static char buf_dis16[16]; sprintf(buf_dis16, "0x%04x"  , val); return buf_dis16; }
static inline       char* t_dis8 (Uns32 val) { static char buf_dis8 [16]; sprintf(buf_dis8 , "0x%02x"  , val); return buf_dis8 ; }

static inline const char* t_reg16(Uns32 val) { return REGNAME_H[val]; }
static inline const char* t_reg8 (Uns32 val) { return REGNAME_B[val]; }

static const char* replace_es(rl78P rl78, const char* txt_tmpl) {

    static char txt_fmt[100 + 1];

    strcpy(txt_fmt, txt_tmpl);

    if (rl78->len_instPrefix == 0) {        // no prefix
        char* pidx = strstr(txt_fmt, "ES:");

        if (pidx != NULL) {
            Uns32 idx = pidx - txt_fmt;
            strcpy(&txt_fmt[idx], &txt_tmpl[idx + 3]);
        }
    }

    return txt_fmt;
}

#define PREFIX_FORMAT                "%s\t%d\t%s"
#define REP(tmpl)                    replace_es(rl78, tmpl)

//#pragma GCC diagnostic push
//#pragma GCC diagnostic ignored "-Wunused-variable"
//#pragma GCC diagnostic ignored "-Wunused-but-set-variable"

// #define RL78_DISPATCH_FN(_NAME) void _NAME( 
//     rl78P rl78,         
//     Uns32 thisPC,       
//     Uns8* instr,        
//     void *userData      
// )
static RL78_DISPATCH_FN(rl78Dis_1_00_NOP        ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "NOP     "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // NOP
static RL78_DISPATCH_FN(rl78Dis_1_02_ADDW       ) { PRE();            op1=R_AX ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "ADDW    AX, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // ADDW    AX, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_04_ADDW       ) { PRE();            op1=R_AX ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "ADDW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_imm16(op2) ); }    // ADDW    AX, #word
static RL78_DISPATCH_FN(rl78Dis_1_06_ADDW       ) { PRE();            op1=R_AX ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "ADDW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // ADDW    AX, saddrp
static RL78_DISPATCH_FN(rl78Dis_1_0X_ADDW       ) { PRE();            op1=R_AX ;            BIT2(op2);  sprintf(userData, REP(PREFIX_FORMAT "ADDW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_reg16(op2) ); }    // ADDW    AX, ??
static RL78_DISPATCH_FN(rl78Dis_1_08_XCH        ) { PRE();            op1=R_A  ;            op2=R_X  ;  sprintf(userData, REP(PREFIX_FORMAT "XCH     A, X"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // XCH     A, X
static RL78_DISPATCH_FN(rl78Dis_1_09_MOV        ) { PRE();            op1=R_A  ; IMM2(dis); op2=R_B  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, ES:%s[B]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis16(dis) ); }    // MOV     A, word[B]
static RL78_DISPATCH_FN(rl78Dis_1_0A_ADD        ) { PRE();            SADDR(op1);           IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "ADD     %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1),      t_imm8 (op2) ); }    // ADD     saddr, #byte
static RL78_DISPATCH_FN(rl78Dis_1_0B_ADD        ) { PRE();            op1=R_A  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "ADD     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // ADD     A, saddr
static RL78_DISPATCH_FN(rl78Dis_1_0C_ADD        ) { PRE();            op1=R_A  ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "ADD     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // ADD     A, #byte
static RL78_DISPATCH_FN(rl78Dis_1_0D_ADD        ) { PRE();            op1=R_A  ;            op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "ADD     A, ES:[HL]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // ADD     A, [HL]
static RL78_DISPATCH_FN(rl78Dis_1_0E_ADD        ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "ADD     A, ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // ADD     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_1_0F_ADD        ) { PRE();            op1=R_A  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "ADD     A, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // ADD     A, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_10_ADDW       ) { PRE();            op1=R_SP ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "ADDW    SP, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // ADDW    SP, #byte
static RL78_DISPATCH_FN(rl78Dis_1_11_PREFIX     ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "PREFIX  "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // PREFIX
static RL78_DISPATCH_FN(rl78Dis_1_1X_MOVW       ) { PRE();            BIT2(op1);            op2=R_AX ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    %s, AX"            ), hex, __LINE__, skipPrefix(rl78), t_reg16(op1)                    ); }    // MOVW    ??, AX
static RL78_DISPATCH_FN(rl78Dis_1_1Y_MOVW       ) { PRE();            op1=R_AX ;            BIT2(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOVW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_reg16(op2) ); }    // MOVW    AX, ??
static RL78_DISPATCH_FN(rl78Dis_1_18_MOV        ) { PRE(); IMM2(dis); op1=R_B  ;            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:%s[B], A"        ), hex, __LINE__, skipPrefix(rl78), t_dis16(dis)                    ); }    // MOV     word[B], A
static RL78_DISPATCH_FN(rl78Dis_1_19_MOV        ) { PRE(); IMM2(dis); op1=R_B  ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:%s[B], %s"        ), hex, __LINE__, skipPrefix(rl78), t_dis16(dis),      t_imm8 (op2) ); }    // MOV     word[B], #byte
static RL78_DISPATCH_FN(rl78Dis_1_1A_ADDC       ) { PRE();            SADDR(op1);           IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "ADDC    %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1),      t_imm8 (op2) ); }    // ADDC    saddr, #byte
static RL78_DISPATCH_FN(rl78Dis_1_1B_ADDC       ) { PRE();            op1=R_A  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "ADDC    A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // ADDC    A, saddr
static RL78_DISPATCH_FN(rl78Dis_1_1C_ADDC       ) { PRE();            op1=R_A  ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "ADDC    A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // ADDC    A, #byte
static RL78_DISPATCH_FN(rl78Dis_1_1D_ADDC       ) { PRE();            op1=R_A  ;            op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "ADDC    A, ES:[HL]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // ADDC    A, [HL]
static RL78_DISPATCH_FN(rl78Dis_1_1E_ADDC       ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "ADDC    A, ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // ADDC    A, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_1_1F_ADDC       ) { PRE();            op1=R_A  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "ADDC    A, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // ADDC    A, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_20_SUBW       ) { PRE();            op1=R_SP ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "SUBW    SP, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // SUBW    SP, #byte
static RL78_DISPATCH_FN(rl78Dis_1_22_SUBW       ) { PRE();            op1=R_AX ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "SUBW    AX, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // SUBW    AX, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_24_SUBW       ) { PRE();            op1=R_AX ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "SUBW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_imm16(op2) ); }    // SUBW    AX, #word
static RL78_DISPATCH_FN(rl78Dis_1_26_SUBW       ) { PRE();            op1=R_AX ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "SUBW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // SUBW    AX, saddrp
static RL78_DISPATCH_FN(rl78Dis_1_2X_SUBW       ) { PRE();            op1=R_AX ;            BIT2(op2);  sprintf(userData, REP(PREFIX_FORMAT "SUBW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_reg16(op2) ); }    // SUBW    AX, ??
static RL78_DISPATCH_FN(rl78Dis_1_28_MOV        ) { PRE(); IMM2(dis); op1=R_C  ;            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:%s[C], A"        ), hex, __LINE__, skipPrefix(rl78), t_dis16(dis)                    ); }    // MOV     word[C] ,A
static RL78_DISPATCH_FN(rl78Dis_1_29_MOV        ) { PRE();            op1=R_A  ; IMM2(dis); op2=R_C  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, ES:%s[C]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis16(dis) ); }    // MOV     A, word[C]
static RL78_DISPATCH_FN(rl78Dis_1_2A_SUB        ) { PRE();            SADDR(op1);           IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "SUB     %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1),      t_imm8 (op2) ); }    // SUB     saddr, #byte
static RL78_DISPATCH_FN(rl78Dis_1_2B_SUB        ) { PRE();            op1=R_A  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "SUB     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // SUB     A, saddr
static RL78_DISPATCH_FN(rl78Dis_1_2C_SUB        ) { PRE();            op1=R_A  ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "SUB     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // SUB     A, #byte
static RL78_DISPATCH_FN(rl78Dis_1_2D_SUB        ) { PRE();            op1=R_A  ;            op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "SUB     A, ES:[HL]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SUB     A, [HL]
static RL78_DISPATCH_FN(rl78Dis_1_2E_SUB        ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "SUB     A, ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // SUB     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_1_2F_SUB        ) { PRE();            op1=R_A  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "SUB     A, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // SUB     A, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_31_4thmap     ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "4thmap  "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // 4thmap
static RL78_DISPATCH_FN(rl78Dis_1_3X_XCHW       ) { PRE();            op1=R_AX ;            BIT2(op2);  sprintf(userData, REP(PREFIX_FORMAT "XCHW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_reg16(op2) ); }    // XCHW    AX, ??
static RL78_DISPATCH_FN(rl78Dis_1_3Y_MOVW       ) { PRE();            BIT2(op1);            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOVW    %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_reg16(op1),      t_imm16(op2) ); }    // MOVW    ??, #word
static RL78_DISPATCH_FN(rl78Dis_1_38_MOV        ) { PRE(); IMM2(dis); op1=R_C  ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:%s[C], %s"        ), hex, __LINE__, skipPrefix(rl78), t_dis16(dis),      t_imm8 (op2) ); }    // MOV     word[C], #byte
static RL78_DISPATCH_FN(rl78Dis_1_39_MOV        ) { PRE(); IMM2(dis); op1=R_BC ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:%s[BC], %s"        ), hex, __LINE__, skipPrefix(rl78), t_dis16(dis),      t_imm8 (op2) ); }    // MOV     word[BC], #byte
static RL78_DISPATCH_FN(rl78Dis_1_3A_SUBC       ) { PRE();            SADDR(op1);           IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "SUBC    %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1),      t_imm8 (op2) ); }    // SUBC    saddr, #byte
static RL78_DISPATCH_FN(rl78Dis_1_3B_SUBC       ) { PRE();            op1=R_A  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "SUBC    A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // SUBC    A, saddr
static RL78_DISPATCH_FN(rl78Dis_1_3C_SUBC       ) { PRE();            op1=R_A  ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "SUBC    A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // SUBC    A, #byte
static RL78_DISPATCH_FN(rl78Dis_1_3D_SUBC       ) { PRE();            op1=R_A  ;            op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "SUBC    A, ES:[HL]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SUBC    A, [HL]
static RL78_DISPATCH_FN(rl78Dis_1_3E_SUBC       ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "SUBC    A, ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // SUBC    A, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_1_3F_SUBC       ) { PRE();            op1=R_A  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "SUBC    A, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // SUBC    A, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_40_CMP        ) { PRE();            IMM2(op1);            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "CMP     ES:%s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1),      t_imm8 (op2) ); }    // CMP     !addr16, #byte
static RL78_DISPATCH_FN(rl78Dis_1_41_MOV        ) { PRE();            op1=R_ES ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // MOV     ES, #byte
static RL78_DISPATCH_FN(rl78Dis_1_42_CMPW       ) { PRE();            op1=R_AX ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "CMPW    AX, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // CMPW    AX, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_44_CMPW       ) { PRE();            op1=R_AX ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "CMPW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_imm16(op2) ); }    // CMPW    AX, #word
static RL78_DISPATCH_FN(rl78Dis_1_46_CMPW       ) { PRE();            op1=R_AX ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "CMPW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // CMPW    AX, saddrp
static RL78_DISPATCH_FN(rl78Dis_1_4X_CMPW       ) { PRE();            op1=R_AX ;            BIT2(op2);  sprintf(userData, REP(PREFIX_FORMAT "CMPW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_reg16(op2) ); }    // CMPW    AX, ??
static RL78_DISPATCH_FN(rl78Dis_1_48_MOV        ) { PRE(); IMM2(dis); op1=R_BC ;            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:%s[BC], A"        ), hex, __LINE__, skipPrefix(rl78), t_dis16(dis)                    ); }    // MOV     word[BC], A
static RL78_DISPATCH_FN(rl78Dis_1_49_MOV        ) { PRE();            op1=R_A  ; IMM2(dis); op2=R_BC ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, ES:%s[BC]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis16(dis) ); }    // MOV     A, word[BC]
static RL78_DISPATCH_FN(rl78Dis_1_4A_CMP        ) { PRE();            SADDR(op1);           IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "CMP     %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1),      t_imm8 (op2) ); }    // CMP     saddr, #byte
static RL78_DISPATCH_FN(rl78Dis_1_4B_CMP        ) { PRE();            op1=R_A  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "CMP     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // CMP     A, saddr
static RL78_DISPATCH_FN(rl78Dis_1_4C_CMP        ) { PRE();            op1=R_A  ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "CMP     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // CMP     A, #byte
static RL78_DISPATCH_FN(rl78Dis_1_4D_CMP        ) { PRE();            op1=R_A  ;            op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "CMP     A, ES:[HL]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // CMP     A, [HL]
static RL78_DISPATCH_FN(rl78Dis_1_4E_CMP        ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "CMP     A, ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // CMP     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_1_4F_CMP        ) { PRE();            op1=R_A  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "CMP     A, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // CMP     A, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_5X_MOV        ) { PRE();            BIT3(op1);            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1),      t_imm8 (op2) ); }    // MOV     ?, #byte
static RL78_DISPATCH_FN(rl78Dis_1_58_MOVW       ) { PRE(); IMM2(dis); op1=R_B  ;            op2=R_AX ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    ES:%s[B], AX"        ), hex, __LINE__, skipPrefix(rl78), t_dis16(dis)                    ); }    // MOVW    word[B], AX
static RL78_DISPATCH_FN(rl78Dis_1_59_MOVW       ) { PRE();            op1=R_AX ; IMM2(dis); op2=R_B  ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    AX, ES:%s[B]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis16(dis) ); }    // MOVW    AX, word[B]
static RL78_DISPATCH_FN(rl78Dis_1_5A_AND        ) { PRE();            SADDR(op1);           IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "AND     %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1),      t_imm8 (op2) ); }    // AND     saddr, #byte
static RL78_DISPATCH_FN(rl78Dis_1_5B_AND        ) { PRE();            op1=R_A  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "AND     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // AND     A, saddr
static RL78_DISPATCH_FN(rl78Dis_1_5C_AND        ) { PRE();            op1=R_A  ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "AND     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // AND     A, #byte
