emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Disassemble.c
static RL78_DISPATCH_FN(rl78Dis_1_5D_AND        ) { PRE();            op1=R_A  ;            op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "AND     A, ES:[HL]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // AND     A, [HL]
static RL78_DISPATCH_FN(rl78Dis_1_5E_AND        ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "AND     A, ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // AND     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_1_5F_AND        ) { PRE();            op1=R_A  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "AND     A, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // AND     A, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_61_2ndmap     ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "2ndmap  "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // 2ndmap
static RL78_DISPATCH_FN(rl78Dis_1_6X_MOV        ) { PRE();            op1=R_A  ;            BIT3(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_reg8 (op2) ); }    // MOV     A, ?
static RL78_DISPATCH_FN(rl78Dis_1_68_MOVW       ) { PRE(); IMM2(dis); op1=R_C  ;            op2=R_AX ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    ES:%s[C], AX"        ), hex, __LINE__, skipPrefix(rl78), t_dis16(dis)                    ); }    // MOVW    word[C], AX
static RL78_DISPATCH_FN(rl78Dis_1_69_MOVW       ) { PRE();            op1=R_AX ; IMM2(dis); op2=R_C  ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    AX, ES:%s[C]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis16(dis) ); }    // MOVW    AX, word[C]
static RL78_DISPATCH_FN(rl78Dis_1_6A_OR         ) { PRE();            SADDR(op1);           IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "OR      %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1),      t_imm8 (op2) ); }    // OR      saddr, #byte
static RL78_DISPATCH_FN(rl78Dis_1_6B_OR         ) { PRE();            op1=R_A  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "OR      A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // OR      A, saddr
static RL78_DISPATCH_FN(rl78Dis_1_6C_OR         ) { PRE();            op1=R_A  ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "OR      A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // OR      A, #byte
static RL78_DISPATCH_FN(rl78Dis_1_6D_OR         ) { PRE();            op1=R_A  ;            op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "OR      A, ES:[HL]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // OR      A, [HL]
static RL78_DISPATCH_FN(rl78Dis_1_6E_OR         ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "OR      A, ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // OR      A, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_1_6F_OR         ) { PRE();            op1=R_A  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "OR      A, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // OR      A, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_71_3rdmap     ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "3rdmap  "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // 3rdmap
static RL78_DISPATCH_FN(rl78Dis_1_7X_MOV        ) { PRE();            BIT3(op1);            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     %s, A"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // MOV     ?, A
static RL78_DISPATCH_FN(rl78Dis_1_78_MOVW       ) { PRE(); IMM2(dis); op1=R_BC ;            op2=R_AX ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    ES:%s[BC], AX"        ), hex, __LINE__, skipPrefix(rl78), t_dis16(dis)                    ); }    // MOVW    word[BC], AX
static RL78_DISPATCH_FN(rl78Dis_1_79_MOVW       ) { PRE();            op1=R_AX ; IMM2(dis); op2=R_BC ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    AX, ES:%s[BC]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis16(dis) ); }    // MOVW    AX, word[BC]
static RL78_DISPATCH_FN(rl78Dis_1_7A_XOR        ) { PRE();            SADDR(op1);           IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "XOR     %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1),      t_imm8 (op2) ); }    // XOR     saddr, #byte
static RL78_DISPATCH_FN(rl78Dis_1_7B_XOR        ) { PRE();            op1=R_A  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "XOR     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // XOR     A, saddr
static RL78_DISPATCH_FN(rl78Dis_1_7C_XOR        ) { PRE();            op1=R_A  ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "XOR     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // XOR     A, #byte
static RL78_DISPATCH_FN(rl78Dis_1_7D_XOR        ) { PRE();            op1=R_A  ;            op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "XOR     A, ES:[HL]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // XOR     A, [HL]
static RL78_DISPATCH_FN(rl78Dis_1_7E_XOR        ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "XOR     A, ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // XOR     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_1_7F_XOR        ) { PRE();            op1=R_A  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "XOR     A, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // XOR     A, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_8X_INC        ) { PRE();            BIT3(op1);                        sprintf(userData, REP(PREFIX_FORMAT "INC     %s"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // INC     ?
static RL78_DISPATCH_FN(rl78Dis_1_88_MOV        ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_SP ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, ES:[SP+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // MOV     A, [SP+byte]
static RL78_DISPATCH_FN(rl78Dis_1_89_MOV        ) { PRE();            op1=R_A  ;            op2=R_DE ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, ES:[DE]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MOV     A, [DE]
static RL78_DISPATCH_FN(rl78Dis_1_8A_MOV        ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_DE ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, ES:[DE+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // MOV     A, [DE+byte]
static RL78_DISPATCH_FN(rl78Dis_1_8B_MOV        ) { PRE();            op1=R_A  ;            op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, ES:[HL]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MOV     A, [HL]
static RL78_DISPATCH_FN(rl78Dis_1_8C_MOV        ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // MOV     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_1_8D_MOV        ) { PRE();            op1=R_A  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "MOV     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // MOV     A, saddr
static RL78_DISPATCH_FN(rl78Dis_1_8E_MOV        ) { PRE();            op1=R_A  ;            SFR(op2) ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // MOV     A, sfr
static RL78_DISPATCH_FN(rl78Dis_1_8F_MOV        ) { PRE();            op1=R_A  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // MOV     A, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_9X_DEC        ) { PRE();            BIT3(op1);                        sprintf(userData, REP(PREFIX_FORMAT "DEC     %s"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // DEC     ?
static RL78_DISPATCH_FN(rl78Dis_1_98_MOV        ) { PRE(); IMM1(dis); op1=R_SP ;            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:[SP+%s], A"        ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis)                    ); }    // MOV     [SP+byte], A
static RL78_DISPATCH_FN(rl78Dis_1_99_MOV        ) { PRE();            op1=R_DE ;            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:[DE], A"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MOV     [DE], A
static RL78_DISPATCH_FN(rl78Dis_1_9A_MOV        ) { PRE(); IMM1(dis); op1=R_DE ;            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:[DE+%s], A"        ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis)                    ); }    // MOV     [DE+byte], A
static RL78_DISPATCH_FN(rl78Dis_1_9B_MOV        ) { PRE();            op1=R_HL ;            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:[HL], A"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MOV     [HL], A
static RL78_DISPATCH_FN(rl78Dis_1_9C_MOV        ) { PRE(); IMM1(dis); op1=R_HL ;            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:[HL+%s], A"        ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis)                    ); }    // MOV     [HL+byte], A
static RL78_DISPATCH_FN(rl78Dis_1_9D_MOV        ) { PRE();            SADDR(op1);           op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     %s, A"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1)                    ); }    // MOV     saddr, A
static RL78_DISPATCH_FN(rl78Dis_1_9E_MOV        ) { PRE();            SFR(op1) ;            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     %s, A"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1)                    ); }    // MOV     sfr, A
static RL78_DISPATCH_FN(rl78Dis_1_9F_MOV        ) { PRE();            IMM2(op1);            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:%s, A"            ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1)                    ); }    // MOV     !addr16, A
static RL78_DISPATCH_FN(rl78Dis_1_A0_INC        ) { PRE();            IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "INC     ES:%s"                ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1)                    ); }    // INC     !addr16
static RL78_DISPATCH_FN(rl78Dis_1_A2_INCW       ) { PRE();            IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "INCW    ES:%s"                ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1)                    ); }    // INCW    !addr16
static RL78_DISPATCH_FN(rl78Dis_1_A4_INC        ) { PRE();            SADDR(op1);                       sprintf(userData, REP(PREFIX_FORMAT "INC     %s"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1)                    ); }    // INC     saddr
static RL78_DISPATCH_FN(rl78Dis_1_A6_INCW       ) { PRE();            SADDR(op1);                       sprintf(userData, REP(PREFIX_FORMAT "INCW    %s"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1)                    ); }    // INCW    saddrp
static RL78_DISPATCH_FN(rl78Dis_1_AX_INCW       ) { PRE();            BIT2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "INCW    %s"                ), hex, __LINE__, skipPrefix(rl78), t_reg16(op1)                    ); }    // INCW    ??
static RL78_DISPATCH_FN(rl78Dis_1_A8_MOVW       ) { PRE();            op1=R_AX ; IMM1(dis); op2=R_SP ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    AX, ES:[SP+%s]"    ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // MOVW    AX, [SP+byte]
static RL78_DISPATCH_FN(rl78Dis_1_A9_MOVW       ) { PRE();            op1=R_AX ;            op2=R_DE ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    AX, ES:[DE]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MOVW    AX, [DE]
static RL78_DISPATCH_FN(rl78Dis_1_AA_MOVW       ) { PRE();            op1=R_AX ; IMM1(dis); op2=R_DE ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    AX, ES:[DE+%s]"    ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // MOVW    AX, [DE+byte]
static RL78_DISPATCH_FN(rl78Dis_1_AB_MOVW       ) { PRE();            op1=R_AX ;            op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    AX, ES:[HL]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MOVW    AX, [HL]
static RL78_DISPATCH_FN(rl78Dis_1_AC_MOVW       ) { PRE();            op1=R_AX ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    AX, ES:[HL+%s]"    ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // MOVW    AX, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_1_AD_MOVW       ) { PRE();            op1=R_AX ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "MOVW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // MOVW    AX, saddrp
static RL78_DISPATCH_FN(rl78Dis_1_AE_MOVW       ) { PRE();            op1=R_AX ;            SFR(op2) ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    AX, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // MOVW    AX, sfrp
static RL78_DISPATCH_FN(rl78Dis_1_AF_MOVW       ) { PRE();            op1=R_AX ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOVW    AX, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // MOVW    AX, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_B0_DEC        ) { PRE();            IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "DEC     ES:%s"                ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1)                    ); }    // DEC     !addr16
static RL78_DISPATCH_FN(rl78Dis_1_B2_DECW       ) { PRE();            IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "DECW    ES:%s"                ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1)                    ); }    // DECW    !addr16
static RL78_DISPATCH_FN(rl78Dis_1_B4_DEC        ) { PRE();            SADDR(op1);                       sprintf(userData, REP(PREFIX_FORMAT "DEC     %s"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1)                    ); }    // DEC     saddr
static RL78_DISPATCH_FN(rl78Dis_1_B6_DECW       ) { PRE();            SADDR(op1);                       sprintf(userData, REP(PREFIX_FORMAT "DECW    %s"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1)                    ); }    // DECW    saddrp
static RL78_DISPATCH_FN(rl78Dis_1_BX_DECW       ) { PRE();            BIT2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "DECW    %s"                ), hex, __LINE__, skipPrefix(rl78), t_reg16(op1)                    ); }    // DECW    ??
static RL78_DISPATCH_FN(rl78Dis_1_B8_MOVW       ) { PRE(); IMM1(dis); op1=R_SP ;            op2=R_AX ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    ES:[SP+%s], AX"    ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis)                    ); }    // MOVW    [SP+byte], AX
static RL78_DISPATCH_FN(rl78Dis_1_B9_MOVW       ) { PRE();            op1=R_DE ;            op2=R_AX ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    ES:[DE], AX"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MOVW    [DE], AX
static RL78_DISPATCH_FN(rl78Dis_1_BA_MOVW       ) { PRE(); IMM1(dis); op1=R_DE ;            op2=R_AX ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    ES:[DE+%s], AX"    ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis)                    ); }    // MOVW    [DE+byte], AX
static RL78_DISPATCH_FN(rl78Dis_1_BB_MOVW       ) { PRE();            op1=R_HL ;            op2=R_AX ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    ES:[HL], AX"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MOVW    [HL], AX
static RL78_DISPATCH_FN(rl78Dis_1_BC_MOVW       ) { PRE(); IMM1(dis); op1=R_HL ;            op2=R_AX ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    ES:[HL+%s], AX"    ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis)                    ); }    // MOVW    [HL+byte], AX
static RL78_DISPATCH_FN(rl78Dis_1_BD_MOVW       ) { PRE();            SADDR(op1);           op2=R_AX ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    %s, AX"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1)                    ); }    // MOVW    saddrp, AX
static RL78_DISPATCH_FN(rl78Dis_1_BE_MOVW       ) { PRE();            SFR(op1) ;            op2=R_AX ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    %s, AX"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1)                    ); }    // MOVW    sfrp, AX
static RL78_DISPATCH_FN(rl78Dis_1_BF_MOVW       ) { PRE();            IMM2(op1);            op2=R_AX ;  sprintf(userData, REP(PREFIX_FORMAT "MOVW    ES:%s, AX"            ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1)                    ); }    // MOVW    !addr16, AX
static RL78_DISPATCH_FN(rl78Dis_1_CX_POP        ) { PRE();            BIT2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "POP     %s"                ), hex, __LINE__, skipPrefix(rl78), t_reg16(op1)                    ); }    // POP     ??
static RL78_DISPATCH_FN(rl78Dis_1_CY_PUSH       ) { PRE();            BIT2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "PUSH    %s"                ), hex, __LINE__, skipPrefix(rl78), t_reg16(op1)                    ); }    // PUSH    ??
static RL78_DISPATCH_FN(rl78Dis_1_C8_MOV        ) { PRE(); IMM1(dis); op1=R_SP ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:[SP+%s], %s"    ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis),      t_imm8 (op2) ); }    // MOV     [SP+byte], #byte
static RL78_DISPATCH_FN(rl78Dis_1_C9_MOVW       ) { PRE();            SADDR(op1);           IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOVW    %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1),      t_imm16(op2) ); }    // MOVW    saddrp, #word
static RL78_DISPATCH_FN(rl78Dis_1_CA_MOV        ) { PRE(); IMM1(dis); op1=R_DE ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:[DE+%s], %s"    ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis),      t_imm8 (op2) ); }    // MOV     [DE+byte], #byte
static RL78_DISPATCH_FN(rl78Dis_1_CB_MOVW       ) { PRE();            SFR(op1) ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOVW    %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1),      t_imm16(op2) ); }    // MOVW    sfrp, #word
static RL78_DISPATCH_FN(rl78Dis_1_CC_MOV        ) { PRE(); IMM1(dis); op1=R_HL ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:[HL+%s], %s"    ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis),      t_imm8 (op2) ); }    // MOV     [HL+byte], #byte
static RL78_DISPATCH_FN(rl78Dis_1_CD_MOV        ) { PRE();            SADDR(op1);           IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1),      t_imm8 (op2) ); }    // MOV     saddr, #byte
static RL78_DISPATCH_FN(rl78Dis_1_CE_MOV_SFR    ) { PRE();            SFR(op1) ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1),      t_imm8 (op2) ); }    // MOV     sfr, #byte
static RL78_DISPATCH_FN(rl78Dis_1_CE_MOV_PSW    ) { PRE();            op1=R_PSW;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     PSW, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // MOV     PSW, #byte
static RL78_DISPATCH_FN(rl78Dis_1_CE_MOV_CS     ) { PRE();            op1=R_CS ;            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     CS, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_imm8 (op2) ); }    // MOV     CS, #byte
static RL78_DISPATCH_FN(rl78Dis_1_CE_MULHU      ) { PRE();            op1=R_AX ;            op2=R_BC ;  sprintf(userData, REP(PREFIX_FORMAT "MULHU   "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MULHU
static RL78_DISPATCH_FN(rl78Dis_1_CE_MULH       ) { PRE();            op1=R_AX ;            op2=R_BC ;  sprintf(userData, REP(PREFIX_FORMAT "MULH    "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MULH
static RL78_DISPATCH_FN(rl78Dis_1_CE_DIVHU      ) { PRE();            op1=R_AX ;            op2=R_DE ;  sprintf(userData, REP(PREFIX_FORMAT "DIVHU   "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // DIVHU
static RL78_DISPATCH_FN(rl78Dis_1_CE_DIVWU      ) { PRE();            op1=R_BCAX;           op2=R_HLDE; sprintf(userData, REP(PREFIX_FORMAT "DIVWU   "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // DIVWU
static RL78_DISPATCH_FN(rl78Dis_1_CE_MACHU      ) { PRE();            op1=R_AX ;            op2=R_BC ;  sprintf(userData, REP(PREFIX_FORMAT "MACHU   "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MACHU
static RL78_DISPATCH_FN(rl78Dis_1_CE_MACH       ) { PRE();            op1=R_AX ;            op2=R_BC ;  sprintf(userData, REP(PREFIX_FORMAT "MACH    "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MACH
static RL78_DISPATCH_FN(rl78Dis_1_CF_MOV        ) { PRE();            IMM2(op1);            IMM1(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:%s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1),      t_imm8 (op2) ); }    // MOV     !addr16, #byte
static RL78_DISPATCH_FN(rl78Dis_1_DX_CMP0       ) { PRE();            BIT3(op1);                        sprintf(userData, REP(PREFIX_FORMAT "CMP0    %s"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // CMP0    ?
static RL78_DISPATCH_FN(rl78Dis_1_D4_CMP0       ) { PRE();            SADDR(op1);                       sprintf(userData, REP(PREFIX_FORMAT "CMP0    %s"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1)                    ); }    // CMP0    saddr
static RL78_DISPATCH_FN(rl78Dis_1_D5_CMP0       ) { PRE();            IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "CMP0    ES:%s"                ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1)                    ); }    // CMP0    !addr16
static RL78_DISPATCH_FN(rl78Dis_1_D6_MULU       ) { PRE();            op1=R_A  ;            op2=R_X  ;  sprintf(userData, REP(PREFIX_FORMAT "MULU    X"                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MULU    X
static RL78_DISPATCH_FN(rl78Dis_1_D7_RET        ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "RET     "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // RET
