emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Disassemble.c
static RL78_DISPATCH_FN(rl78Dis_1_D8_MOV        ) { PRE();            op1=R_X  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "MOV     X, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // MOV     X, saddr
static RL78_DISPATCH_FN(rl78Dis_1_D9_MOV        ) { PRE();            op1=R_X  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     X, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // MOV     X, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_DC_BC         ) { PRE();            IMM1(op1);                        sprintf(userData, REP(PREFIX_FORMAT "BC      %s"                ), hex, __LINE__, skipPrefix(rl78), t_rel8 (op1)                    ); }    // BC      $addr20
static RL78_DISPATCH_FN(rl78Dis_1_DD_BZ         ) { PRE();            IMM1(op1);                        sprintf(userData, REP(PREFIX_FORMAT "BZ      %s"                ), hex, __LINE__, skipPrefix(rl78), t_rel8 (op1)                    ); }    // BZ      $addr20
static RL78_DISPATCH_FN(rl78Dis_1_DE_BNC        ) { PRE();            IMM1(op1);                        sprintf(userData, REP(PREFIX_FORMAT "BNC     %s"                ), hex, __LINE__, skipPrefix(rl78), t_rel8 (op1)                    ); }    // BNC     $addr20
static RL78_DISPATCH_FN(rl78Dis_1_DF_BNZ        ) { PRE();            IMM1(op1);                        sprintf(userData, REP(PREFIX_FORMAT "BNZ     %s"                ), hex, __LINE__, skipPrefix(rl78), t_rel8 (op1)                    ); }    // BNZ     $addr20
static RL78_DISPATCH_FN(rl78Dis_1_EX_ONEB       ) { PRE();            BIT3(op1);                        sprintf(userData, REP(PREFIX_FORMAT "ONEB    %s"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // ONEB    ?
static RL78_DISPATCH_FN(rl78Dis_1_E4_ONEB       ) { PRE();            SADDR(op1);                       sprintf(userData, REP(PREFIX_FORMAT "ONEB    %s"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1)                    ); }    // ONEB    saddr
static RL78_DISPATCH_FN(rl78Dis_1_E5_ONEB       ) { PRE();            IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "ONEB    ES:%s"                ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1)                    ); }    // ONEB    !addr16
static RL78_DISPATCH_FN(rl78Dis_1_E6_ONEW       ) { PRE();            op1=R_AX ;                        sprintf(userData, REP(PREFIX_FORMAT "ONEW    AX"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // ONEW    AX
static RL78_DISPATCH_FN(rl78Dis_1_E7_ONEW       ) { PRE();            op1=R_BC ;                        sprintf(userData, REP(PREFIX_FORMAT "ONEW    BC"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // ONEW    BC
static RL78_DISPATCH_FN(rl78Dis_1_E8_MOV        ) { PRE();            op1=R_B  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "MOV     B, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // MOV     B, saddr
static RL78_DISPATCH_FN(rl78Dis_1_E9_MOV        ) { PRE();            op1=R_B  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     B, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // MOV     B, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_EC_BR         ) { PRE();            IMM3(op1);                        sprintf(userData, REP(PREFIX_FORMAT "BR      %s"                ), hex, __LINE__, skipPrefix(rl78), t_abs20(op1)                    ); }    // BR      !!addr20
static RL78_DISPATCH_FN(rl78Dis_1_ED_BR         ) { PRE();            IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "BR      %s"                ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1)                    ); }    // BR      !addr16
static RL78_DISPATCH_FN(rl78Dis_1_EE_BR         ) { PRE();            IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "BR      %s"                ), hex, __LINE__, skipPrefix(rl78), t_rel16(op1)                    ); }    // BR      $!addr20
static RL78_DISPATCH_FN(rl78Dis_1_EF_BR         ) { PRE();            IMM1(op1);                        sprintf(userData, REP(PREFIX_FORMAT "BR      %s"                ), hex, __LINE__, skipPrefix(rl78), t_rel8 (op1)                    ); }    // BR      $addr20
static RL78_DISPATCH_FN(rl78Dis_1_FX_CLRB       ) { PRE();            BIT3(op1);                        sprintf(userData, REP(PREFIX_FORMAT "CLRB    %s"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // CLRB    ?
static RL78_DISPATCH_FN(rl78Dis_1_F4_CLRB       ) { PRE();            SADDR(op1);                       sprintf(userData, REP(PREFIX_FORMAT "CLRB    %s"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1)                    ); }    // CLRB    saddr
static RL78_DISPATCH_FN(rl78Dis_1_F5_CLRB       ) { PRE();            IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "CLRB    ES:%s"                ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1)                    ); }    // CLRB    !addr16
static RL78_DISPATCH_FN(rl78Dis_1_F6_CLRW       ) { PRE();            op1=R_AX ;                        sprintf(userData, REP(PREFIX_FORMAT "CLRW    AX"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // CLRW    AX
static RL78_DISPATCH_FN(rl78Dis_1_F7_CLRW       ) { PRE();            op1=R_BC ;                        sprintf(userData, REP(PREFIX_FORMAT "CLRW    BC"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // CLRW    BC
static RL78_DISPATCH_FN(rl78Dis_1_F8_MOV        ) { PRE();            op1=R_C  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "MOV     C, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // MOV     C, saddr
static RL78_DISPATCH_FN(rl78Dis_1_F9_MOV        ) { PRE();            op1=R_C  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOV     C, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // MOV     C, !addr16
static RL78_DISPATCH_FN(rl78Dis_1_FC_CALL       ) { PRE();            IMM3(op1);                        sprintf(userData, REP(PREFIX_FORMAT "CALL    %s"                ), hex, __LINE__, skipPrefix(rl78), t_abs20(op1)                    ); }    // CALL    !!addr20
static RL78_DISPATCH_FN(rl78Dis_1_FD_CALL       ) { PRE();            IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "CALL    %s"                ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1)                    ); }    // CALL    !addr16
static RL78_DISPATCH_FN(rl78Dis_1_FE_CALL       ) { PRE();            IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "CALL    %s"                ), hex, __LINE__, skipPrefix(rl78), t_rel16(op1)                    ); }    // CALL    $!addr20
static RL78_DISPATCH_FN(rl78Dis_1_XA_MOVW       ) { PRE();            BIT(op1,4,2);         SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "MOVW    %s, %s"            ), hex, __LINE__, skipPrefix(rl78), t_reg16(op1),      t_adr8 (op2) ); }    // MOVW    ??, saddrp
static RL78_DISPATCH_FN(rl78Dis_1_XB_MOVW       ) { PRE();            BIT(op1,4,2);         IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "MOVW    %s, ES:%s"            ), hex, __LINE__, skipPrefix(rl78), t_reg16(op1),      t_abs16(op2) ); }    // MOVW    ??, !addr16

