emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Disassemble.c
static RL78_DISPATCH_FN(rl78Dis_2_0X_ADD        ) { PRE();            BIT3(op1);            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "ADD     %s, A"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // ADD     ?, A
static RL78_DISPATCH_FN(rl78Dis_2_09_ADDW       ) { PRE();            op1=R_AX ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "ADDW    AX, ES:[HL+%s]"    ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // ADDW    AX, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_2_0Y_ADD        ) { PRE();            op1=R_A  ;            BIT3(op2);  sprintf(userData, REP(PREFIX_FORMAT "ADD     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_reg8 (op2) ); }    // ADD     A, ?
static RL78_DISPATCH_FN(rl78Dis_2_1X_ADDC       ) { PRE();            BIT3(op1);            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "ADDC    %s, A"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // ADDC    ?, A
static RL78_DISPATCH_FN(rl78Dis_2_1Y_ADDC       ) { PRE();            op1=R_A  ;            BIT3(op2);  sprintf(userData, REP(PREFIX_FORMAT "ADDC    A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_reg8 (op2) ); }    // ADDC    A, ?
static RL78_DISPATCH_FN(rl78Dis_2_2X_SUB        ) { PRE();            BIT3(op1);            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "SUB     %s, A"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // SUB     ?, A
static RL78_DISPATCH_FN(rl78Dis_2_29_SUBW       ) { PRE();            op1=R_AX ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "SUBW    AX, ES:[HL+%s]"    ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // SUBW    AX, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_2_2Y_SUB        ) { PRE();            op1=R_A  ;            BIT3(op2);  sprintf(userData, REP(PREFIX_FORMAT "SUB     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_reg8 (op2) ); }    // SUB     A, ?
static RL78_DISPATCH_FN(rl78Dis_2_3X_SUBC       ) { PRE();            BIT3(op1);            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "SUBC    %s, A"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // SUBC    ?, A
static RL78_DISPATCH_FN(rl78Dis_2_3Y_SUBC       ) { PRE();            op1=R_A  ;            BIT3(op2);  sprintf(userData, REP(PREFIX_FORMAT "SUBC    A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_reg8 (op2) ); }    // SUBC    A, ?
static RL78_DISPATCH_FN(rl78Dis_2_4X_CMP        ) { PRE();            BIT3(op1);            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "CMP     %s, A"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // CMP     ?, A
static RL78_DISPATCH_FN(rl78Dis_2_49_CMPW       ) { PRE();            op1=R_AX ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "CMPW    AX, ES:[HL+%s]"    ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // CMPW    AX, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_2_4Y_CMP        ) { PRE();            op1=R_A  ;            BIT3(op2);  sprintf(userData, REP(PREFIX_FORMAT "CMP     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_reg8 (op2) ); }    // CMP     A, ?
static RL78_DISPATCH_FN(rl78Dis_2_5X_AND        ) { PRE();            BIT3(op1);            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "AND     %s, A"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // AND     ?, A
static RL78_DISPATCH_FN(rl78Dis_2_59_INC        ) { PRE(); IMM1(dis); op1=R_HL ;                        sprintf(userData, REP(PREFIX_FORMAT "INC     ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis)                    ); }    // INC     [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_2_5Y_AND        ) { PRE();            op1=R_A  ;            BIT3(op2);  sprintf(userData, REP(PREFIX_FORMAT "AND     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_reg8 (op2) ); }    // AND     A, ?
static RL78_DISPATCH_FN(rl78Dis_2_6X_OR         ) { PRE();            BIT3(op1);            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "OR      %s, A"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // OR      ?, A
static RL78_DISPATCH_FN(rl78Dis_2_69_DEC        ) { PRE(); IMM1(dis); op1=R_HL ;                        sprintf(userData, REP(PREFIX_FORMAT "DEC     ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis)                    ); }    // DEC     [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_2_6Y_OR         ) { PRE();            op1=R_A  ;            BIT3(op2);  sprintf(userData, REP(PREFIX_FORMAT "OR      A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_reg8 (op2) ); }    // OR      A, ?
static RL78_DISPATCH_FN(rl78Dis_2_7X_XOR        ) { PRE();            BIT3(op1);            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "XOR     %s, A"                ), hex, __LINE__, skipPrefix(rl78), t_reg8 (op1)                    ); }    // XOR     ?, A
static RL78_DISPATCH_FN(rl78Dis_2_79_INCW       ) { PRE(); IMM1(dis); op1=R_HL ;                        sprintf(userData, REP(PREFIX_FORMAT "INCW    ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis)                    ); }    // INCW    [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_2_7Y_XOR        ) { PRE();            op1=R_A  ;            BIT3(op2);  sprintf(userData, REP(PREFIX_FORMAT "XOR     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_reg8 (op2) ); }    // XOR     A, ?
static RL78_DISPATCH_FN(rl78Dis_2_80_ADD        ) { PRE();            op1=R_A  ;            op2=R_B  ;  sprintf(userData, REP(PREFIX_FORMAT "ADD     A, ES:[HL+B]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // ADD     A, [HL+B]
static RL78_DISPATCH_FN(rl78Dis_2_82_ADD        ) { PRE();            op1=R_A  ;            op2=R_C  ;  sprintf(userData, REP(PREFIX_FORMAT "ADD     A, ES:[HL+C]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // ADD     A, [HL+C]
static RL78_DISPATCH_FN(rl78Dis_2_89_DECW       ) { PRE(); IMM1(dis); op1=R_HL ;                        sprintf(userData, REP(PREFIX_FORMAT "DECW    ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis)                    ); }    // DECW    [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_2_8X_XCH        ) { PRE();            op1=R_A  ;            BIT3(op2);  sprintf(userData, REP(PREFIX_FORMAT "XCH     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_reg8 (op2) ); }    // XCH     A, ?
static RL78_DISPATCH_FN(rl78Dis_2_90_ADDC       ) { PRE();            op1=R_A  ;            op2=R_B  ;  sprintf(userData, REP(PREFIX_FORMAT "ADDC    A, ES:[HL+B]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // ADDC    A, [HL+B]
static RL78_DISPATCH_FN(rl78Dis_2_92_ADDC       ) { PRE();            op1=R_A  ;            op2=R_C  ;  sprintf(userData, REP(PREFIX_FORMAT "ADDC    A, ES:[HL+C]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // ADDC    A, [HL+C]
static RL78_DISPATCH_FN(rl78Dis_2_A0_SUB        ) { PRE();            op1=R_A  ;            op2=R_B  ;  sprintf(userData, REP(PREFIX_FORMAT "SUB     A, ES:[HL+B]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SUB     A, [HL+B]
static RL78_DISPATCH_FN(rl78Dis_2_A2_SUB        ) { PRE();            op1=R_A  ;            op2=R_C  ;  sprintf(userData, REP(PREFIX_FORMAT "SUB     A, ES:[HL+C]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SUB     A, [HL+C]
static RL78_DISPATCH_FN(rl78Dis_2_A8_XCH        ) { PRE();            op1=R_A  ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "XCH     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // XCH     A, saddr
static RL78_DISPATCH_FN(rl78Dis_2_A9_XCH        ) { PRE();            op1=R_A  ;            op2=R_C  ;  sprintf(userData, REP(PREFIX_FORMAT "XCH     A, ES:[HL+C]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // XCH     A, [HL+C]
static RL78_DISPATCH_FN(rl78Dis_2_AA_XCH        ) { PRE();            op1=R_A  ;            IMM2(op2);  sprintf(userData, REP(PREFIX_FORMAT "XCH     A, ES:%s"            ), hex, __LINE__, skipPrefix(rl78),                    t_abs16(op2) ); }    // XCH     A, !addr16
static RL78_DISPATCH_FN(rl78Dis_2_AB_XCH        ) { PRE();            op1=R_A  ;            SFR(op2) ;  sprintf(userData, REP(PREFIX_FORMAT "XCH     A, %s"                ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // XCH     A, sfr
static RL78_DISPATCH_FN(rl78Dis_2_AC_XCH        ) { PRE();            op1=R_A  ;            op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "XCH     A, ES:[HL]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // XCH     A, [HL]
static RL78_DISPATCH_FN(rl78Dis_2_AD_XCH        ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "XCH     A, ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // XCH     A, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_2_AE_XCH        ) { PRE();            op1=R_A  ;            op2=R_DE ;  sprintf(userData, REP(PREFIX_FORMAT "XCH     A, ES:[DE]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // XCH     A, [DE]
static RL78_DISPATCH_FN(rl78Dis_2_AF_XCH        ) { PRE();            op1=R_A  ; IMM1(dis); op2=R_DE ;  sprintf(userData, REP(PREFIX_FORMAT "XCH     A, ES:[DE+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // XCH     A, [DE+byte]
static RL78_DISPATCH_FN(rl78Dis_2_B0_SUBC       ) { PRE();            op1=R_A  ;            op2=R_B  ;  sprintf(userData, REP(PREFIX_FORMAT "SUBC    A, ES:[HL+B]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SUBC    A, [HL+B]
static RL78_DISPATCH_FN(rl78Dis_2_B2_SUBC       ) { PRE();            op1=R_A  ;            op2=R_C  ;  sprintf(userData, REP(PREFIX_FORMAT "SUBC    A, ES:[HL+C]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SUBC    A, [HL+C]
static RL78_DISPATCH_FN(rl78Dis_2_B8_MOV        ) { PRE();            op1=R_ES ;            SADDR(op2); sprintf(userData, REP(PREFIX_FORMAT "MOV     ES, %s"            ), hex, __LINE__, skipPrefix(rl78),                    t_adr8 (op2) ); }    // MOV     ES, saddr
static RL78_DISPATCH_FN(rl78Dis_2_B9_XCH        ) { PRE();            op1=R_A  ;            op2=R_B  ;  sprintf(userData, REP(PREFIX_FORMAT "XCH     A, ES:[HL+B]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // XCH     A, [HL+B]
static RL78_DISPATCH_FN(rl78Dis_2_C0_CMP        ) { PRE();            op1=R_A  ;            op2=R_B  ;  sprintf(userData, REP(PREFIX_FORMAT "CMP     A, ES:[HL+B]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // CMP     A, [HL+B]
static RL78_DISPATCH_FN(rl78Dis_2_C2_CMP        ) { PRE();            op1=R_A  ;            op2=R_C  ;  sprintf(userData, REP(PREFIX_FORMAT "CMP     A, ES:[HL+C]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // CMP     A, [HL+C]
static RL78_DISPATCH_FN(rl78Dis_2_C3_BH         ) { PRE();            IMM1(op1);                        sprintf(userData, REP(PREFIX_FORMAT "BH      %s"                ), hex, __LINE__, skipPrefix(rl78), t_rel8 (op1)                    ); }    // BH      $addr20
static RL78_DISPATCH_FN(rl78Dis_2_C8_SKC        ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "SKC     "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SKC
static RL78_DISPATCH_FN(rl78Dis_2_C9_MOV        ) { PRE();            op1=R_A  ;            op2=R_B  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, ES:[HL+B]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MOV     A, [HL+B]
static RL78_DISPATCH_FN(rl78Dis_2_CB_BR         ) { PRE();            op1=R_AX ;                        sprintf(userData, REP(PREFIX_FORMAT "BR      AX"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // BR      AX
static RL78_DISPATCH_FN(rl78Dis_2_CC_BRK        ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "BRK     "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // BRK
static RL78_DISPATCH_FN(rl78Dis_2_CD_POP        ) { PRE();            op1=R_PSW;                        sprintf(userData, REP(PREFIX_FORMAT "POP     PSW"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // POP     PSW
static RL78_DISPATCH_FN(rl78Dis_2_CE_MOVS       ) { PRE(); IMM1(dis); op1=R_HL ;            op2=R_X  ;  sprintf(userData, REP(PREFIX_FORMAT "MOVS    ES:[HL+%s], X"        ), hex, __LINE__, skipPrefix(rl78), t_dis8 (dis)                    ); }    // MOVS    [HL+byte], X
static RL78_DISPATCH_FN(rl78Dis_2_D0_AND        ) { PRE();            op1=R_A  ;            op2=R_B  ;  sprintf(userData, REP(PREFIX_FORMAT "AND     A, ES:[HL+B]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // AND     A, [HL+B]
static RL78_DISPATCH_FN(rl78Dis_2_D2_AND        ) { PRE();            op1=R_A  ;            op2=R_C  ;  sprintf(userData, REP(PREFIX_FORMAT "AND     A, ES:[HL+C]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // AND     A, [HL+C]
static RL78_DISPATCH_FN(rl78Dis_2_D3_BNH        ) { PRE();            IMM1(op1);                        sprintf(userData, REP(PREFIX_FORMAT "BNH     %s"                ), hex, __LINE__, skipPrefix(rl78), t_rel8 (op1)                    ); }    // BNH     $addr20
static RL78_DISPATCH_FN(rl78Dis_2_D8_SKNC       ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "SKNC    "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SKNC
static RL78_DISPATCH_FN(rl78Dis_2_D9_MOV        ) { PRE();            op1=R_B  ;            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:[HL+B], A"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MOV     [HL+B], A
static RL78_DISPATCH_FN(rl78Dis_2_DB_ROR        ) { PRE();            op1=R_A  ;                        sprintf(userData, REP(PREFIX_FORMAT "ROR     A, 1"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // ROR     A, 1
static RL78_DISPATCH_FN(rl78Dis_2_DC_ROLC       ) { PRE();            op1=R_A  ;                        sprintf(userData, REP(PREFIX_FORMAT "ROLC    A, 1"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // ROLC    A, 1
static RL78_DISPATCH_FN(rl78Dis_2_DD_PUSH       ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "PUSH    PSW"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // PUSH    PSW
static RL78_DISPATCH_FN(rl78Dis_2_DE_CMPS       ) { PRE();            op1=R_X  ; IMM1(dis); op2=R_HL ;  sprintf(userData, REP(PREFIX_FORMAT "CMPS    X, ES:[HL+%s]"        ), hex, __LINE__, skipPrefix(rl78),                    t_dis8 (dis) ); }    // CMPS    X, [HL+byte]
static RL78_DISPATCH_FN(rl78Dis_2_E0_OR         ) { PRE();            op1=R_A  ;            op2=R_B  ;  sprintf(userData, REP(PREFIX_FORMAT "OR      A, ES:[HL+B]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // OR      A, [HL+B]
static RL78_DISPATCH_FN(rl78Dis_2_E2_OR         ) { PRE();            op1=R_A  ;            op2=R_C  ;  sprintf(userData, REP(PREFIX_FORMAT "OR      A, ES:[HL+C]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // OR      A, [HL+C]
static RL78_DISPATCH_FN(rl78Dis_2_E3_SKH        ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "SKH     "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SKH
static RL78_DISPATCH_FN(rl78Dis_2_E8_SKZ        ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "SKZ     "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SKZ
static RL78_DISPATCH_FN(rl78Dis_2_E9_MOV        ) { PRE();            op1=R_A  ;            op2=R_C  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     A, ES:[HL+C]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MOV     A, [HL+C]
static RL78_DISPATCH_FN(rl78Dis_2_EB_ROL        ) { PRE();            op1=R_A  ;                        sprintf(userData, REP(PREFIX_FORMAT "ROL     A, 1"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // ROL     A, 1
static RL78_DISPATCH_FN(rl78Dis_2_EC_RETB       ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "RETB    "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // RETB
static RL78_DISPATCH_FN(rl78Dis_2_ED_HALT       ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "HALT    "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // HALT
static RL78_DISPATCH_FN(rl78Dis_2_F0_XOR        ) { PRE();            op1=R_A  ;            op2=R_B  ;  sprintf(userData, REP(PREFIX_FORMAT "XOR     A, ES:[HL+B]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // XOR     A, [HL+B]
static RL78_DISPATCH_FN(rl78Dis_2_F2_XOR        ) { PRE();            op1=R_A  ;            op2=R_C  ;  sprintf(userData, REP(PREFIX_FORMAT "XOR     A, ES:[HL+C]"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // XOR     A, [HL+C]
static RL78_DISPATCH_FN(rl78Dis_2_F3_SKNH       ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "SKNH    "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SKNH
static RL78_DISPATCH_FN(rl78Dis_2_F8_SKNZ       ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "SKNZ    "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SKNZ
static RL78_DISPATCH_FN(rl78Dis_2_F9_MOV        ) { PRE();            op1=R_C  ;            op2=R_A  ;  sprintf(userData, REP(PREFIX_FORMAT "MOV     ES:[HL+C], A"        ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // MOV     [HL+C], A
static RL78_DISPATCH_FN(rl78Dis_2_FB_RORC       ) { PRE();            op1=R_A  ;                        sprintf(userData, REP(PREFIX_FORMAT "RORC    A, 1"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // RORC    A, 1
static RL78_DISPATCH_FN(rl78Dis_2_FC_RETI       ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "RETI    "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // RETI
static RL78_DISPATCH_FN(rl78Dis_2_FD_STOP       ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "STOP    "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // STOP
static RL78_DISPATCH_FN(rl78Dis_2_XE_ROLWC      ) { PRE();            BIT(op1,4,1);                     sprintf(userData, REP(PREFIX_FORMAT "ROLWC   %s, 1"                ), hex, __LINE__, skipPrefix(rl78), t_reg16(op1)                    ); }    // ROLWC   ??, 1
static RL78_DISPATCH_FN(rl78Dis_2_XF_SEL        ) { PRE();            BIT(op1,4,2);                     sprintf(userData, REP(PREFIX_FORMAT "SEL     RB%d"                ), hex, __LINE__, skipPrefix(rl78),         op1                     ); }    // SEL     RBn
static RL78_DISPATCH_FN(rl78Dis_2_XA_CALL       ) { PRE();            BIT(op1,4,2);                     sprintf(userData, REP(PREFIX_FORMAT "CALL    %s"                ), hex, __LINE__, skipPrefix(rl78), t_reg16(op1)                    ); }    // CALL    ??
static RL78_DISPATCH_FN(rl78Dis_2_XX_CALLT      ) { PRE();            BIT(op1,4,3); BIT(op2,0,2);       sprintf(userData, REP(PREFIX_FORMAT "CALLT   [00%01x%01xh]"        ), hex, __LINE__, skipPrefix(rl78), op2 + 8,  op1 << 1              ); }    // CALLT   [00nnh]

