emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Disassemble.c
static RL78_DISPATCH_FN(rl78Dis_3_X0_SET1       ) { PRE(); IDX3(ix1); IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "SET1    ES:%s.%d"            ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1), ix1               ); }    // SET1    !addr16.n
static RL78_DISPATCH_FN(rl78Dis_3_X1_MOV1       ) { PRE(); IDX3(ix1); SADDR(op1);           op2=R_CY ;  sprintf(userData, REP(PREFIX_FORMAT "MOV1    %s.%d, CY"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1), ix1               ); }    // MOV1    saddr.n, CY
static RL78_DISPATCH_FN(rl78Dis_3_X2_SET1       ) { PRE(); IDX3(ix1); SADDR(op1);                       sprintf(userData, REP(PREFIX_FORMAT "SET1    %s.%d"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1), ix1               ); }    // SET1    saddr.n
static RL78_DISPATCH_FN(rl78Dis_3_X3_CLR1       ) { PRE(); IDX3(ix1); SADDR(op1);                       sprintf(userData, REP(PREFIX_FORMAT "CLR1    %s.%d"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1), ix1               ); }    // CLR1    saddr.n
static RL78_DISPATCH_FN(rl78Dis_3_X4_MOV1       ) { PRE(); IDX3(ix1); op1=R_CY ; SADDR(op2);            sprintf(userData, REP(PREFIX_FORMAT "MOV1    CY, %s.%d"            ), hex, __LINE__, skipPrefix(rl78),               t_adr8 (op2), ix1 ); }    // MOV1    CY, saddr.n
static RL78_DISPATCH_FN(rl78Dis_3_X5_AND1       ) { PRE(); IDX3(ix1); op1=R_CY ; SADDR(op2);            sprintf(userData, REP(PREFIX_FORMAT "AND1    CY, %s.%d"            ), hex, __LINE__, skipPrefix(rl78),               t_adr8 (op2), ix1 ); }    // AND1    CY, saddr.n
static RL78_DISPATCH_FN(rl78Dis_3_X6_OR1        ) { PRE(); IDX3(ix1); op1=R_CY ; SADDR(op2);            sprintf(userData, REP(PREFIX_FORMAT "OR1     CY, %s.%d"            ), hex, __LINE__, skipPrefix(rl78),               t_adr8 (op2), ix1 ); }    // OR1     CY, saddr.n
static RL78_DISPATCH_FN(rl78Dis_3_X7_XOR1       ) { PRE(); IDX3(ix1); op1=R_CY ; SADDR(op2);            sprintf(userData, REP(PREFIX_FORMAT "XOR1    CY, %s.%d"            ), hex, __LINE__, skipPrefix(rl78),               t_adr8 (op2), ix1 ); }    // XOR1    CY, saddr.n
static RL78_DISPATCH_FN(rl78Dis_3_X8_CLR1       ) { PRE(); IDX3(ix1); IMM2(op1);                        sprintf(userData, REP(PREFIX_FORMAT "CLR1    ES:%s.%d"            ), hex, __LINE__, skipPrefix(rl78), t_abs16(op1), ix1               ); }    // CLR1    !addr16.n
static RL78_DISPATCH_FN(rl78Dis_3_X9_MOV1       ) { PRE(); IDX3(ix1); SFR(op1) ;            op2=R_CY ;  sprintf(userData, REP(PREFIX_FORMAT "MOV1    %s.%d, CY"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1), ix1               ); }    // MOV1    sfr.n, CY
static RL78_DISPATCH_FN(rl78Dis_3_XA_SET1       ) { PRE(); IDX3(ix1); SFR(op1) ;                        sprintf(userData, REP(PREFIX_FORMAT "SET1    %s.%d"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1), ix1               ); }    // SET1    sfr.n
static RL78_DISPATCH_FN(rl78Dis_3_XB_CLR1       ) { PRE(); IDX3(ix1); SFR(op1) ;                        sprintf(userData, REP(PREFIX_FORMAT "CLR1    %s.%d"                ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1), ix1               ); }    // CLR1    sfr.n
static RL78_DISPATCH_FN(rl78Dis_3_XC_MOV1       ) { PRE(); IDX3(ix1); op1=R_CY ; SFR(op2) ;             sprintf(userData, REP(PREFIX_FORMAT "MOV1    CY, %s.%d"            ), hex, __LINE__, skipPrefix(rl78),               t_adr8 (op2), ix1 ); }    // MOV1    CY, sfr.n
static RL78_DISPATCH_FN(rl78Dis_3_XD_AND1       ) { PRE(); IDX3(ix1); op1=R_CY ; SFR(op2) ;             sprintf(userData, REP(PREFIX_FORMAT "AND1    CY, %s.%d"            ), hex, __LINE__, skipPrefix(rl78),               t_adr8 (op2), ix1 ); }    // AND1    CY, sfr.n
static RL78_DISPATCH_FN(rl78Dis_3_XE_OR1        ) { PRE(); IDX3(ix1); op1=R_CY ; SFR(op2) ;             sprintf(userData, REP(PREFIX_FORMAT "OR1     CY, %s.%d"            ), hex, __LINE__, skipPrefix(rl78),               t_adr8 (op2), ix1 ); }    // OR1     CY, sfr.n
static RL78_DISPATCH_FN(rl78Dis_3_XF_XOR1       ) { PRE(); IDX3(ix1); op1=R_CY ; SFR(op2) ;             sprintf(userData, REP(PREFIX_FORMAT "XOR1    CY, %s.%d"            ), hex, __LINE__, skipPrefix(rl78),               t_adr8 (op2), ix1 ); }    // XOR1    CY, sfr.n
static RL78_DISPATCH_FN(rl78Dis_3_7A_EI         ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "EI      "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // EI
static RL78_DISPATCH_FN(rl78Dis_3_7B_DI         ) { PRE();                                              sprintf(userData, REP(PREFIX_FORMAT "DI      "                    ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // DI
static RL78_DISPATCH_FN(rl78Dis_3_80_SET1       ) { PRE();            op1=R_CY ;                        sprintf(userData, REP(PREFIX_FORMAT "SET1    CY"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // SET1    CY
static RL78_DISPATCH_FN(rl78Dis_3_88_CLR1       ) { PRE();            op1=R_CY ;                        sprintf(userData, REP(PREFIX_FORMAT "CLR1    CY"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // CLR1    CY
static RL78_DISPATCH_FN(rl78Dis_3_C0_NOT1       ) { PRE();            op1=R_CY ;                        sprintf(userData, REP(PREFIX_FORMAT "NOT1    CY"                ), hex, __LINE__, skipPrefix(rl78)                                  ); }    // NOT1    CY
static RL78_DISPATCH_FN(rl78Dis_3_Y1_MOV1       ) { PRE(); IDX3(ix1); op1=R_HL ;            op2=R_CY;   sprintf(userData, REP(PREFIX_FORMAT "MOV1    ES:[HL].%d, CY"    ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // MOV1    [HL].n, CY
static RL78_DISPATCH_FN(rl78Dis_3_Y2_SET1       ) { PRE(); IDX3(ix1); op1=R_HL ;                        sprintf(userData, REP(PREFIX_FORMAT "SET1    ES:[HL].%d"        ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // SET1    [HL].n
static RL78_DISPATCH_FN(rl78Dis_3_Y3_CLR1       ) { PRE(); IDX3(ix1); op1=R_HL ;                        sprintf(userData, REP(PREFIX_FORMAT "CLR1    ES:[HL].%d"        ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // CLR1    [HL].n
static RL78_DISPATCH_FN(rl78Dis_3_Y4_MOV1       ) { PRE(); IDX3(ix1);            op2=R_HL ;             sprintf(userData, REP(PREFIX_FORMAT "MOV1    CY, ES:[HL].%d"    ), hex, __LINE__, skipPrefix(rl78),                             ix1 ); }    // MOV1    CY, [HL].n
static RL78_DISPATCH_FN(rl78Dis_3_Y5_AND1       ) { PRE(); IDX3(ix1);            op2=R_HL ;             sprintf(userData, REP(PREFIX_FORMAT "AND1    CY, ES:[HL].%d"    ), hex, __LINE__, skipPrefix(rl78),                             ix1 ); }    // AND1    CY, [HL].n
static RL78_DISPATCH_FN(rl78Dis_3_Y6_OR1        ) { PRE(); IDX3(ix1);            op2=R_HL ;             sprintf(userData, REP(PREFIX_FORMAT "OR1     CY, ES:[HL].%d"    ), hex, __LINE__, skipPrefix(rl78),                             ix1 ); }    // OR1     CY, [HL].n
static RL78_DISPATCH_FN(rl78Dis_3_Y7_XOR1       ) { PRE(); IDX3(ix1);            op2=R_HL ;             sprintf(userData, REP(PREFIX_FORMAT "XOR1    CY, ES:[HL].%d"    ), hex, __LINE__, skipPrefix(rl78),                             ix1 ); }    // XOR1    CY, [HL].n
static RL78_DISPATCH_FN(rl78Dis_3_Y9_MOV1       ) { PRE(); IDX3(ix1); op1=R_A  ;            op2=R_CY;   sprintf(userData, REP(PREFIX_FORMAT "MOV1    A.%d, CY"            ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // MOV1    A.n, CY
static RL78_DISPATCH_FN(rl78Dis_3_YA_SET1       ) { PRE(); IDX3(ix1); op1=R_A  ;                        sprintf(userData, REP(PREFIX_FORMAT "SET1    A.%d"                ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // SET1    A.n
static RL78_DISPATCH_FN(rl78Dis_3_YB_CLR1       ) { PRE(); IDX3(ix1); op1=R_A  ;                        sprintf(userData, REP(PREFIX_FORMAT "CLR1    A.%d"                ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // CLR1    A.n
static RL78_DISPATCH_FN(rl78Dis_3_YC_MOV1       ) { PRE(); IDX3(ix1); op1=R_CY ; op2=R_A  ;             sprintf(userData, REP(PREFIX_FORMAT "MOV1    CY, A.%d"            ), hex, __LINE__, skipPrefix(rl78),                             ix1 ); }    // MOV1    CY, A.n
static RL78_DISPATCH_FN(rl78Dis_3_YD_AND1       ) { PRE(); IDX3(ix1); op1=R_CY ; op2=R_A  ;             sprintf(userData, REP(PREFIX_FORMAT "AND1    CY, A.%d"            ), hex, __LINE__, skipPrefix(rl78),                             ix1 ); }    // AND1    CY, A.n
static RL78_DISPATCH_FN(rl78Dis_3_YE_OR1        ) { PRE(); IDX3(ix1); op1=R_CY ; op2=R_A  ;             sprintf(userData, REP(PREFIX_FORMAT "OR1     CY, A.%d"            ), hex, __LINE__, skipPrefix(rl78),                             ix1 ); }    // OR1     CY, A.n
static RL78_DISPATCH_FN(rl78Dis_3_YF_XOR1       ) { PRE(); IDX3(ix1); op1=R_CY ; op2=R_A  ;             sprintf(userData, REP(PREFIX_FORMAT "XOR1    CY, A.%d"            ), hex, __LINE__, skipPrefix(rl78),                             ix1 ); }    // XOR1    CY, A.n

static RL78_DISPATCH_FN(rl78Dis_4_X0_BTCLR      ) { PRE(); IDX3(ix1); SADDR(op1);IMM1(op2);             sprintf(userData, REP(PREFIX_FORMAT "BTCLR   %s.%d, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1), ix1, t_rel8 (op2) ); }    // BTCLR   saddr.n, $addr20
static RL78_DISPATCH_FN(rl78Dis_4_X1_BTCLR      ) { PRE(); IDX3(ix1); op1=R_A  ; IMM1(op2);             sprintf(userData, REP(PREFIX_FORMAT "BTCLR   A.%d, %s"            ), hex, __LINE__, skipPrefix(rl78),               ix1, t_rel8 (op2) ); }    // BTCLR   A.n, $addr20
static RL78_DISPATCH_FN(rl78Dis_4_X2_BT         ) { PRE(); IDX3(ix1); SADDR(op1);IMM1(op2);             sprintf(userData, REP(PREFIX_FORMAT "BT      %s.%d, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1), ix1, t_rel8 (op2) ); }    // BT      saddr.n, $addr20
static RL78_DISPATCH_FN(rl78Dis_4_X3_BT         ) { PRE(); IDX3(ix1); op1=R_A  ; IMM1(op2);             sprintf(userData, REP(PREFIX_FORMAT "BT      A.%d, %s"            ), hex, __LINE__, skipPrefix(rl78),               ix1, t_rel8 (op2) ); }    // BT      A.n, $addr20
static RL78_DISPATCH_FN(rl78Dis_4_X4_BF         ) { PRE(); IDX3(ix1); SADDR(op1);IMM1(op2);             sprintf(userData, REP(PREFIX_FORMAT "BF      %s.%d, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1), ix1, t_rel8 (op2) ); }    // BF      saddr.n, $addr20
static RL78_DISPATCH_FN(rl78Dis_4_X5_BF         ) { PRE(); IDX3(ix1); op1=R_A  ; IMM1(op2);             sprintf(userData, REP(PREFIX_FORMAT "BF      A.%d, %s"            ), hex, __LINE__, skipPrefix(rl78),               ix1, t_rel8 (op2) ); }    // BF      A.n, $addr20
static RL78_DISPATCH_FN(rl78Dis_4_X7_SHL        ) { PRE(); IDX3(ix1); op1=R_C  ;                        sprintf(userData, REP(PREFIX_FORMAT "SHL     C, %d"                ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // SHL     C, n
static RL78_DISPATCH_FN(rl78Dis_4_X8_SHL        ) { PRE(); IDX3(ix1); op1=R_B  ;                        sprintf(userData, REP(PREFIX_FORMAT "SHL     B, %d"                ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // SHL     B, n
static RL78_DISPATCH_FN(rl78Dis_4_X9_SHL        ) { PRE(); IDX3(ix1); op1=R_A  ;                        sprintf(userData, REP(PREFIX_FORMAT "SHL     A, %d"                ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // SHL     A, n
static RL78_DISPATCH_FN(rl78Dis_4_XA_SHR        ) { PRE(); IDX3(ix1); op1=R_A  ;                        sprintf(userData, REP(PREFIX_FORMAT "SHR     A, %d"                ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // SHR     A, n
static RL78_DISPATCH_FN(rl78Dis_4_XB_SAR        ) { PRE(); IDX3(ix1); op1=R_A  ;                        sprintf(userData, REP(PREFIX_FORMAT "SAR     A, %d"                ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // SAR     A, n
static RL78_DISPATCH_FN(rl78Dis_4_Y0_BTCLR      ) { PRE(); IDX3(ix1); SFR(op1) ; IMM1(op2);             sprintf(userData, REP(PREFIX_FORMAT "BTCLR   %s.%d, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1), ix1, t_rel8 (op2) ); }    // BTCLR   sfr.n, $addr20
static RL78_DISPATCH_FN(rl78Dis_4_Y1_BTCLR      ) { PRE(); IDX3(ix1); op1=R_HL ; IMM1(op2);             sprintf(userData, REP(PREFIX_FORMAT "BTCLR   ES:[HL].%d, %s"    ), hex, __LINE__, skipPrefix(rl78),               ix1, t_rel8 (op2) ); }    // BTCLR   [HL].n, $addr20
static RL78_DISPATCH_FN(rl78Dis_4_Y2_BT         ) { PRE(); IDX3(ix1); SFR(op1) ; IMM1(op2);             sprintf(userData, REP(PREFIX_FORMAT "BT      %s.%d, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1), ix1, t_rel8 (op2) ); }    // BT      sfr.n, $addr20
static RL78_DISPATCH_FN(rl78Dis_4_Y3_BT         ) { PRE(); IDX3(ix1); op1=R_HL ; IMM1(op2);             sprintf(userData, REP(PREFIX_FORMAT "BT      ES:[HL].%d, %s"    ), hex, __LINE__, skipPrefix(rl78),               ix1, t_rel8 (op2) ); }    // BT      [HL].n, $addr20
static RL78_DISPATCH_FN(rl78Dis_4_Y4_BF         ) { PRE(); IDX3(ix1); SFR(op1) ; IMM1(op2);             sprintf(userData, REP(PREFIX_FORMAT "BF      %s.%d, %s"            ), hex, __LINE__, skipPrefix(rl78), t_adr8 (op1), ix1, t_rel8 (op2) ); }    // BF      sfr.n, $addr20
static RL78_DISPATCH_FN(rl78Dis_4_Y5_BF         ) { PRE(); IDX3(ix1); op1=R_HL ; IMM1(op2);             sprintf(userData, REP(PREFIX_FORMAT "BF      ES:[HL].%d, %s"    ), hex, __LINE__, skipPrefix(rl78),               ix1, t_rel8 (op2) ); }    // BF      [HL].n, $addr20
static RL78_DISPATCH_FN(rl78Dis_4_XC_SHLW       ) { PRE(); IDX4(ix1); op1=R_BC ;                        sprintf(userData, REP(PREFIX_FORMAT "SHLW    BC, %d"            ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // SHLW    BC, nn
static RL78_DISPATCH_FN(rl78Dis_4_XD_SHLW       ) { PRE(); IDX4(ix1); op1=R_AX ;                        sprintf(userData, REP(PREFIX_FORMAT "SHLW    AX, %d"            ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // SHLW    AX, nn
static RL78_DISPATCH_FN(rl78Dis_4_XE_SHRW       ) { PRE(); IDX4(ix1); op1=R_AX ;                        sprintf(userData, REP(PREFIX_FORMAT "SHRW    AX, %d"            ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // SHRW    AX, nn
static RL78_DISPATCH_FN(rl78Dis_4_XF_SARW       ) { PRE(); IDX4(ix1); op1=R_AX ;                        sprintf(userData, REP(PREFIX_FORMAT "SARW    AX, %d"            ), hex, __LINE__, skipPrefix(rl78),               ix1               ); }    // SARW    AX, nn

