emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Disassemble.c
//#pragma GCC diagnostic pop



//
// RL78 disassembler dispatch table
//
static rl78DispatchTableC dispatchTable = {

    [RL78_IT_1_00_NOP      ] = rl78Dis_1_00_NOP      ,
    [RL78_IT_1_02_ADDW     ] = rl78Dis_1_02_ADDW     ,
    [RL78_IT_1_04_ADDW     ] = rl78Dis_1_04_ADDW     ,
    [RL78_IT_1_06_ADDW     ] = rl78Dis_1_06_ADDW     ,
    [RL78_IT_1_0X_ADDW     ] = rl78Dis_1_0X_ADDW     ,
    [RL78_IT_1_08_XCH      ] = rl78Dis_1_08_XCH      ,
    [RL78_IT_1_09_MOV      ] = rl78Dis_1_09_MOV      ,
    [RL78_IT_1_0A_ADD      ] = rl78Dis_1_0A_ADD      ,
    [RL78_IT_1_0B_ADD      ] = rl78Dis_1_0B_ADD      ,
    [RL78_IT_1_0C_ADD      ] = rl78Dis_1_0C_ADD      ,
    [RL78_IT_1_0D_ADD      ] = rl78Dis_1_0D_ADD      ,
    [RL78_IT_1_0E_ADD      ] = rl78Dis_1_0E_ADD      ,
    [RL78_IT_1_0F_ADD      ] = rl78Dis_1_0F_ADD      ,
    [RL78_IT_1_10_ADDW     ] = rl78Dis_1_10_ADDW     ,
    [RL78_IT_1_11_PREFIX   ] = rl78Dis_1_11_PREFIX   ,
    [RL78_IT_1_1X_MOVW     ] = rl78Dis_1_1X_MOVW     ,
    [RL78_IT_1_1Y_MOVW     ] = rl78Dis_1_1Y_MOVW     ,
    [RL78_IT_1_18_MOV      ] = rl78Dis_1_18_MOV      ,
    [RL78_IT_1_19_MOV      ] = rl78Dis_1_19_MOV      ,
    [RL78_IT_1_1A_ADDC     ] = rl78Dis_1_1A_ADDC     ,
    [RL78_IT_1_1B_ADDC     ] = rl78Dis_1_1B_ADDC     ,
    [RL78_IT_1_1C_ADDC     ] = rl78Dis_1_1C_ADDC     ,
    [RL78_IT_1_1D_ADDC     ] = rl78Dis_1_1D_ADDC     ,
    [RL78_IT_1_1E_ADDC     ] = rl78Dis_1_1E_ADDC     ,
    [RL78_IT_1_1F_ADDC     ] = rl78Dis_1_1F_ADDC     ,
    [RL78_IT_1_20_SUBW     ] = rl78Dis_1_20_SUBW     ,
    [RL78_IT_1_22_SUBW     ] = rl78Dis_1_22_SUBW     ,
    [RL78_IT_1_24_SUBW     ] = rl78Dis_1_24_SUBW     ,
    [RL78_IT_1_26_SUBW     ] = rl78Dis_1_26_SUBW     ,
    [RL78_IT_1_2X_SUBW     ] = rl78Dis_1_2X_SUBW     ,
    [RL78_IT_1_28_MOV      ] = rl78Dis_1_28_MOV      ,
    [RL78_IT_1_29_MOV      ] = rl78Dis_1_29_MOV      ,
    [RL78_IT_1_2A_SUB      ] = rl78Dis_1_2A_SUB      ,
    [RL78_IT_1_2B_SUB      ] = rl78Dis_1_2B_SUB      ,
    [RL78_IT_1_2C_SUB      ] = rl78Dis_1_2C_SUB      ,
    [RL78_IT_1_2D_SUB      ] = rl78Dis_1_2D_SUB      ,
    [RL78_IT_1_2E_SUB      ] = rl78Dis_1_2E_SUB      ,
    [RL78_IT_1_2F_SUB      ] = rl78Dis_1_2F_SUB      ,
    [RL78_IT_1_31_4thmap   ] = rl78Dis_1_31_4thmap   ,
    [RL78_IT_1_3X_XCHW     ] = rl78Dis_1_3X_XCHW     ,
    [RL78_IT_1_3Y_MOVW     ] = rl78Dis_1_3Y_MOVW     ,
    [RL78_IT_1_38_MOV      ] = rl78Dis_1_38_MOV      ,
    [RL78_IT_1_39_MOV      ] = rl78Dis_1_39_MOV      ,
    [RL78_IT_1_3A_SUBC     ] = rl78Dis_1_3A_SUBC     ,
    [RL78_IT_1_3B_SUBC     ] = rl78Dis_1_3B_SUBC     ,
    [RL78_IT_1_3C_SUBC     ] = rl78Dis_1_3C_SUBC     ,
    [RL78_IT_1_3D_SUBC     ] = rl78Dis_1_3D_SUBC     ,
    [RL78_IT_1_3E_SUBC     ] = rl78Dis_1_3E_SUBC     ,
    [RL78_IT_1_3F_SUBC     ] = rl78Dis_1_3F_SUBC     ,
    [RL78_IT_1_40_CMP      ] = rl78Dis_1_40_CMP      ,
    [RL78_IT_1_41_MOV      ] = rl78Dis_1_41_MOV      ,
    [RL78_IT_1_42_CMPW     ] = rl78Dis_1_42_CMPW     ,
    [RL78_IT_1_44_CMPW     ] = rl78Dis_1_44_CMPW     ,
    [RL78_IT_1_46_CMPW     ] = rl78Dis_1_46_CMPW     ,
    [RL78_IT_1_4X_CMPW     ] = rl78Dis_1_4X_CMPW     ,
    [RL78_IT_1_48_MOV      ] = rl78Dis_1_48_MOV      ,
    [RL78_IT_1_49_MOV      ] = rl78Dis_1_49_MOV      ,
    [RL78_IT_1_4A_CMP      ] = rl78Dis_1_4A_CMP      ,
    [RL78_IT_1_4B_CMP      ] = rl78Dis_1_4B_CMP      ,
    [RL78_IT_1_4C_CMP      ] = rl78Dis_1_4C_CMP      ,
    [RL78_IT_1_4D_CMP      ] = rl78Dis_1_4D_CMP      ,
    [RL78_IT_1_4E_CMP      ] = rl78Dis_1_4E_CMP      ,
    [RL78_IT_1_4F_CMP      ] = rl78Dis_1_4F_CMP      ,
    [RL78_IT_1_5X_MOV      ] = rl78Dis_1_5X_MOV      ,
    [RL78_IT_1_58_MOVW     ] = rl78Dis_1_58_MOVW     ,
    [RL78_IT_1_59_MOVW     ] = rl78Dis_1_59_MOVW     ,
    [RL78_IT_1_5A_AND      ] = rl78Dis_1_5A_AND      ,
    [RL78_IT_1_5B_AND      ] = rl78Dis_1_5B_AND      ,
    [RL78_IT_1_5C_AND      ] = rl78Dis_1_5C_AND      ,
    [RL78_IT_1_5D_AND      ] = rl78Dis_1_5D_AND      ,
    [RL78_IT_1_5E_AND      ] = rl78Dis_1_5E_AND      ,
    [RL78_IT_1_5F_AND      ] = rl78Dis_1_5F_AND      ,
    [RL78_IT_1_61_2ndmap   ] = rl78Dis_1_61_2ndmap   ,
    [RL78_IT_1_6X_MOV      ] = rl78Dis_1_6X_MOV      ,
    [RL78_IT_1_68_MOVW     ] = rl78Dis_1_68_MOVW     ,
    [RL78_IT_1_69_MOVW     ] = rl78Dis_1_69_MOVW     ,
    [RL78_IT_1_6A_OR       ] = rl78Dis_1_6A_OR       ,
    [RL78_IT_1_6B_OR       ] = rl78Dis_1_6B_OR       ,
    [RL78_IT_1_6C_OR       ] = rl78Dis_1_6C_OR       ,
    [RL78_IT_1_6D_OR       ] = rl78Dis_1_6D_OR       ,
    [RL78_IT_1_6E_OR       ] = rl78Dis_1_6E_OR       ,
    [RL78_IT_1_6F_OR       ] = rl78Dis_1_6F_OR       ,
    [RL78_IT_1_71_3rdmap   ] = rl78Dis_1_71_3rdmap   ,
    [RL78_IT_1_7X_MOV      ] = rl78Dis_1_7X_MOV      ,
    [RL78_IT_1_78_MOVW     ] = rl78Dis_1_78_MOVW     ,
    [RL78_IT_1_79_MOVW     ] = rl78Dis_1_79_MOVW     ,
    [RL78_IT_1_7A_XOR      ] = rl78Dis_1_7A_XOR      ,
    [RL78_IT_1_7B_XOR      ] = rl78Dis_1_7B_XOR      ,
    [RL78_IT_1_7C_XOR      ] = rl78Dis_1_7C_XOR      ,
    [RL78_IT_1_7D_XOR      ] = rl78Dis_1_7D_XOR      ,
    [RL78_IT_1_7E_XOR      ] = rl78Dis_1_7E_XOR      ,
    [RL78_IT_1_7F_XOR      ] = rl78Dis_1_7F_XOR      ,
    [RL78_IT_1_8X_INC      ] = rl78Dis_1_8X_INC      ,
    [RL78_IT_1_88_MOV      ] = rl78Dis_1_88_MOV      ,
    [RL78_IT_1_89_MOV      ] = rl78Dis_1_89_MOV      ,
    [RL78_IT_1_8A_MOV      ] = rl78Dis_1_8A_MOV      ,
    [RL78_IT_1_8B_MOV      ] = rl78Dis_1_8B_MOV      ,
    [RL78_IT_1_8C_MOV      ] = rl78Dis_1_8C_MOV      ,
    [RL78_IT_1_8D_MOV      ] = rl78Dis_1_8D_MOV      ,
    [RL78_IT_1_8E_MOV      ] = rl78Dis_1_8E_MOV      ,
    [RL78_IT_1_8F_MOV      ] = rl78Dis_1_8F_MOV      ,
    [RL78_IT_1_9X_DEC      ] = rl78Dis_1_9X_DEC      ,
    [RL78_IT_1_98_MOV      ] = rl78Dis_1_98_MOV      ,
    [RL78_IT_1_99_MOV      ] = rl78Dis_1_99_MOV      ,
    [RL78_IT_1_9A_MOV      ] = rl78Dis_1_9A_MOV      ,
    [RL78_IT_1_9B_MOV      ] = rl78Dis_1_9B_MOV      ,
    [RL78_IT_1_9C_MOV      ] = rl78Dis_1_9C_MOV      ,
    [RL78_IT_1_9D_MOV      ] = rl78Dis_1_9D_MOV      ,
    [RL78_IT_1_9E_MOV      ] = rl78Dis_1_9E_MOV      ,
    [RL78_IT_1_9F_MOV      ] = rl78Dis_1_9F_MOV      ,
    [RL78_IT_1_A0_INC      ] = rl78Dis_1_A0_INC      ,
    [RL78_IT_1_A2_INCW     ] = rl78Dis_1_A2_INCW     ,
    [RL78_IT_1_A4_INC      ] = rl78Dis_1_A4_INC      ,
    [RL78_IT_1_A6_INCW     ] = rl78Dis_1_A6_INCW     ,
    [RL78_IT_1_AX_INCW     ] = rl78Dis_1_AX_INCW     ,
    [RL78_IT_1_A8_MOVW     ] = rl78Dis_1_A8_MOVW     ,
    [RL78_IT_1_A9_MOVW     ] = rl78Dis_1_A9_MOVW     ,
    [RL78_IT_1_AA_MOVW     ] = rl78Dis_1_AA_MOVW     ,
    [RL78_IT_1_AB_MOVW     ] = rl78Dis_1_AB_MOVW     ,
    [RL78_IT_1_AC_MOVW     ] = rl78Dis_1_AC_MOVW     ,
    [RL78_IT_1_AD_MOVW     ] = rl78Dis_1_AD_MOVW     ,
    [RL78_IT_1_AE_MOVW     ] = rl78Dis_1_AE_MOVW     ,
    [RL78_IT_1_AF_MOVW     ] = rl78Dis_1_AF_MOVW     ,
    [RL78_IT_1_B0_DEC      ] = rl78Dis_1_B0_DEC      ,
    [RL78_IT_1_B2_DECW     ] = rl78Dis_1_B2_DECW     ,
    [RL78_IT_1_B4_DEC      ] = rl78Dis_1_B4_DEC      ,
    [RL78_IT_1_B6_DECW     ] = rl78Dis_1_B6_DECW     ,
    [RL78_IT_1_BX_DECW     ] = rl78Dis_1_BX_DECW     ,
    [RL78_IT_1_B8_MOVW     ] = rl78Dis_1_B8_MOVW     ,
    [RL78_IT_1_B9_MOVW     ] = rl78Dis_1_B9_MOVW     ,
    [RL78_IT_1_BA_MOVW     ] = rl78Dis_1_BA_MOVW     ,
    [RL78_IT_1_BB_MOVW     ] = rl78Dis_1_BB_MOVW     ,
    [RL78_IT_1_BC_MOVW     ] = rl78Dis_1_BC_MOVW     ,
    [RL78_IT_1_BD_MOVW     ] = rl78Dis_1_BD_MOVW     ,
    [RL78_IT_1_BE_MOVW     ] = rl78Dis_1_BE_MOVW     ,
    [RL78_IT_1_BF_MOVW     ] = rl78Dis_1_BF_MOVW     ,
    [RL78_IT_1_CX_POP      ] = rl78Dis_1_CX_POP      ,
    [RL78_IT_1_CY_PUSH     ] = rl78Dis_1_CY_PUSH     ,
    [RL78_IT_1_C8_MOV      ] = rl78Dis_1_C8_MOV      ,
    [RL78_IT_1_C9_MOVW     ] = rl78Dis_1_C9_MOVW     ,
    [RL78_IT_1_CA_MOV      ] = rl78Dis_1_CA_MOV      ,
    [RL78_IT_1_CB_MOVW     ] = rl78Dis_1_CB_MOVW     ,
    [RL78_IT_1_CC_MOV      ] = rl78Dis_1_CC_MOV      ,
    [RL78_IT_1_CD_MOV      ] = rl78Dis_1_CD_MOV      ,
    [RL78_IT_1_CE_MOV_SFR  ] = rl78Dis_1_CE_MOV_SFR  ,
    [RL78_IT_1_CE_MOV_PSW  ] = rl78Dis_1_CE_MOV_PSW  ,
    [RL78_IT_1_CE_MOV_CS   ] = rl78Dis_1_CE_MOV_CS   ,
    [RL78_IT_1_CE_MULHU    ] = rl78Dis_1_CE_MULHU    ,
    [RL78_IT_1_CE_MULH     ] = rl78Dis_1_CE_MULH     ,
    [RL78_IT_1_CE_DIVHU    ] = rl78Dis_1_CE_DIVHU    ,
    [RL78_IT_1_CE_DIVWU    ] = rl78Dis_1_CE_DIVWU    ,
    [RL78_IT_1_CE_MACHU    ] = rl78Dis_1_CE_MACHU    ,
    [RL78_IT_1_CE_MACH     ] = rl78Dis_1_CE_MACH     ,
    [RL78_IT_1_CF_MOV      ] = rl78Dis_1_CF_MOV      ,
    [RL78_IT_1_DX_CMP0     ] = rl78Dis_1_DX_CMP0     ,
    [RL78_IT_1_D4_CMP0     ] = rl78Dis_1_D4_CMP0     ,
    [RL78_IT_1_D5_CMP0     ] = rl78Dis_1_D5_CMP0     ,
    [RL78_IT_1_D6_MULU     ] = rl78Dis_1_D6_MULU     ,
    [RL78_IT_1_D7_RET      ] = rl78Dis_1_D7_RET      ,
    [RL78_IT_1_D8_MOV      ] = rl78Dis_1_D8_MOV      ,
    [RL78_IT_1_D9_MOV      ] = rl78Dis_1_D9_MOV      ,
    [RL78_IT_1_DC_BC       ] = rl78Dis_1_DC_BC       ,
    [RL78_IT_1_DD_BZ       ] = rl78Dis_1_DD_BZ       ,
    [RL78_IT_1_DE_BNC      ] = rl78Dis_1_DE_BNC      ,
    [RL78_IT_1_DF_BNZ      ] = rl78Dis_1_DF_BNZ      ,
    [RL78_IT_1_EX_ONEB     ] = rl78Dis_1_EX_ONEB     ,
    [RL78_IT_1_E4_ONEB     ] = rl78Dis_1_E4_ONEB     ,
    [RL78_IT_1_E5_ONEB     ] = rl78Dis_1_E5_ONEB     ,
    [RL78_IT_1_E6_ONEW     ] = rl78Dis_1_E6_ONEW     ,
    [RL78_IT_1_E7_ONEW     ] = rl78Dis_1_E7_ONEW     ,
    [RL78_IT_1_E8_MOV      ] = rl78Dis_1_E8_MOV      ,
    [RL78_IT_1_E9_MOV      ] = rl78Dis_1_E9_MOV      ,
    [RL78_IT_1_EC_BR       ] = rl78Dis_1_EC_BR       ,
    [RL78_IT_1_ED_BR       ] = rl78Dis_1_ED_BR       ,
    [RL78_IT_1_EE_BR       ] = rl78Dis_1_EE_BR       ,
    [RL78_IT_1_EF_BR       ] = rl78Dis_1_EF_BR       ,
    [RL78_IT_1_FX_CLRB     ] = rl78Dis_1_FX_CLRB     ,
    [RL78_IT_1_F4_CLRB     ] = rl78Dis_1_F4_CLRB     ,
    [RL78_IT_1_F5_CLRB     ] = rl78Dis_1_F5_CLRB     ,
    [RL78_IT_1_F6_CLRW     ] = rl78Dis_1_F6_CLRW     ,
    [RL78_IT_1_F7_CLRW     ] = rl78Dis_1_F7_CLRW     ,
    [RL78_IT_1_F8_MOV      ] = rl78Dis_1_F8_MOV      ,
    [RL78_IT_1_F9_MOV      ] = rl78Dis_1_F9_MOV      ,
    [RL78_IT_1_FC_CALL     ] = rl78Dis_1_FC_CALL     ,
    [RL78_IT_1_FD_CALL     ] = rl78Dis_1_FD_CALL     ,
    [RL78_IT_1_FE_CALL     ] = rl78Dis_1_FE_CALL     ,
    [RL78_IT_1_XA_MOVW     ] = rl78Dis_1_XA_MOVW     ,
    [RL78_IT_1_XB_MOVW     ] = rl78Dis_1_XB_MOVW     ,

    [RL78_IT_2_0X_ADD      ] = rl78Dis_2_0X_ADD      ,
    [RL78_IT_2_09_ADDW     ] = rl78Dis_2_09_ADDW     ,
    [RL78_IT_2_0Y_ADD      ] = rl78Dis_2_0Y_ADD      ,
    [RL78_IT_2_1X_ADDC     ] = rl78Dis_2_1X_ADDC     ,
    [RL78_IT_2_1Y_ADDC     ] = rl78Dis_2_1Y_ADDC     ,
    [RL78_IT_2_2X_SUB      ] = rl78Dis_2_2X_SUB      ,
    [RL78_IT_2_29_SUBW     ] = rl78Dis_2_29_SUBW     ,
    [RL78_IT_2_2Y_SUB      ] = rl78Dis_2_2Y_SUB      ,
    [RL78_IT_2_3X_SUBC     ] = rl78Dis_2_3X_SUBC     ,
    [RL78_IT_2_3Y_SUBC     ] = rl78Dis_2_3Y_SUBC     ,
    [RL78_IT_2_4X_CMP      ] = rl78Dis_2_4X_CMP      ,
    [RL78_IT_2_49_CMPW     ] = rl78Dis_2_49_CMPW     ,
    [RL78_IT_2_4Y_CMP      ] = rl78Dis_2_4Y_CMP      ,
    [RL78_IT_2_5X_AND      ] = rl78Dis_2_5X_AND      ,
    [RL78_IT_2_59_INC      ] = rl78Dis_2_59_INC      ,
    [RL78_IT_2_5Y_AND      ] = rl78Dis_2_5Y_AND      ,
    [RL78_IT_2_6X_OR       ] = rl78Dis_2_6X_OR       ,
    [RL78_IT_2_69_DEC      ] = rl78Dis_2_69_DEC      ,
    [RL78_IT_2_6Y_OR       ] = rl78Dis_2_6Y_OR       ,
    [RL78_IT_2_7X_XOR      ] = rl78Dis_2_7X_XOR      ,
    [RL78_IT_2_79_INCW     ] = rl78Dis_2_79_INCW     ,
    [RL78_IT_2_7Y_XOR      ] = rl78Dis_2_7Y_XOR      ,
    [RL78_IT_2_80_ADD      ] = rl78Dis_2_80_ADD      ,
    [RL78_IT_2_82_ADD      ] = rl78Dis_2_82_ADD      ,
    [RL78_IT_2_89_DECW     ] = rl78Dis_2_89_DECW     ,
    [RL78_IT_2_8X_XCH      ] = rl78Dis_2_8X_XCH      ,
    [RL78_IT_2_90_ADDC     ] = rl78Dis_2_90_ADDC     ,
    [RL78_IT_2_92_ADDC     ] = rl78Dis_2_92_ADDC     ,
    [RL78_IT_2_A0_SUB      ] = rl78Dis_2_A0_SUB      ,
    [RL78_IT_2_A2_SUB      ] = rl78Dis_2_A2_SUB      ,
    [RL78_IT_2_A8_XCH      ] = rl78Dis_2_A8_XCH      ,
    [RL78_IT_2_A9_XCH      ] = rl78Dis_2_A9_XCH      ,
    [RL78_IT_2_AA_XCH      ] = rl78Dis_2_AA_XCH      ,
    [RL78_IT_2_AB_XCH      ] = rl78Dis_2_AB_XCH      ,
    [RL78_IT_2_AC_XCH      ] = rl78Dis_2_AC_XCH      ,
    [RL78_IT_2_AD_XCH      ] = rl78Dis_2_AD_XCH      ,
    [RL78_IT_2_AE_XCH      ] = rl78Dis_2_AE_XCH      ,
    [RL78_IT_2_AF_XCH      ] = rl78Dis_2_AF_XCH      ,
    [RL78_IT_2_B0_SUBC     ] = rl78Dis_2_B0_SUBC     ,
    [RL78_IT_2_B2_SUBC     ] = rl78Dis_2_B2_SUBC     ,
    [RL78_IT_2_B8_MOV      ] = rl78Dis_2_B8_MOV      ,
    [RL78_IT_2_B9_XCH      ] = rl78Dis_2_B9_XCH      ,
    [RL78_IT_2_C0_CMP      ] = rl78Dis_2_C0_CMP      ,
    [RL78_IT_2_C2_CMP      ] = rl78Dis_2_C2_CMP      ,
    [RL78_IT_2_C3_BH       ] = rl78Dis_2_C3_BH       ,
    [RL78_IT_2_C8_SKC      ] = rl78Dis_2_C8_SKC      ,
    [RL78_IT_2_C9_MOV      ] = rl78Dis_2_C9_MOV      ,
    [RL78_IT_2_CB_BR       ] = rl78Dis_2_CB_BR       ,
    [RL78_IT_2_CC_BRK      ] = rl78Dis_2_CC_BRK      ,
    [RL78_IT_2_CD_POP      ] = rl78Dis_2_CD_POP      ,
    [RL78_IT_2_CE_MOVS     ] = rl78Dis_2_CE_MOVS     ,
    [RL78_IT_2_D0_AND      ] = rl78Dis_2_D0_AND      ,
    [RL78_IT_2_D2_AND      ] = rl78Dis_2_D2_AND      ,
    [RL78_IT_2_D3_BNH      ] = rl78Dis_2_D3_BNH      ,
    [RL78_IT_2_D8_SKNC     ] = rl78Dis_2_D8_SKNC     ,
    [RL78_IT_2_D9_MOV      ] = rl78Dis_2_D9_MOV      ,
    [RL78_IT_2_DB_ROR      ] = rl78Dis_2_DB_ROR      ,
    [RL78_IT_2_DC_ROLC     ] = rl78Dis_2_DC_ROLC     ,
    [RL78_IT_2_DD_PUSH     ] = rl78Dis_2_DD_PUSH     ,
    [RL78_IT_2_DE_CMPS     ] = rl78Dis_2_DE_CMPS     ,
    [RL78_IT_2_E0_OR       ] = rl78Dis_2_E0_OR       ,
    [RL78_IT_2_E2_OR       ] = rl78Dis_2_E2_OR       ,
    [RL78_IT_2_E3_SKH      ] = rl78Dis_2_E3_SKH      ,
    [RL78_IT_2_E8_SKZ      ] = rl78Dis_2_E8_SKZ      ,
    [RL78_IT_2_E9_MOV      ] = rl78Dis_2_E9_MOV      ,
    [RL78_IT_2_EB_ROL      ] = rl78Dis_2_EB_ROL      ,
    [RL78_IT_2_EC_RETB     ] = rl78Dis_2_EC_RETB     ,
    [RL78_IT_2_ED_HALT     ] = rl78Dis_2_ED_HALT     ,
    [RL78_IT_2_F0_XOR      ] = rl78Dis_2_F0_XOR      ,
    [RL78_IT_2_F2_XOR      ] = rl78Dis_2_F2_XOR      ,
    [RL78_IT_2_F3_SKNH     ] = rl78Dis_2_F3_SKNH     ,
    [RL78_IT_2_F8_SKNZ     ] = rl78Dis_2_F8_SKNZ     ,
    [RL78_IT_2_F9_MOV      ] = rl78Dis_2_F9_MOV      ,
    [RL78_IT_2_FB_RORC     ] = rl78Dis_2_FB_RORC     ,
    [RL78_IT_2_FC_RETI     ] = rl78Dis_2_FC_RETI     ,
    [RL78_IT_2_FD_STOP     ] = rl78Dis_2_FD_STOP     ,
    [RL78_IT_2_XE_ROLWC    ] = rl78Dis_2_XE_ROLWC    ,
    [RL78_IT_2_XF_SEL      ] = rl78Dis_2_XF_SEL      ,
    [RL78_IT_2_XA_CALL     ] = rl78Dis_2_XA_CALL     ,
    [RL78_IT_2_XX_CALLT    ] = rl78Dis_2_XX_CALLT    ,

