emanuellucas2/OVPsimProject/ImperasLib/source/renesas.ovpworld.org/processor/rl78/1.0/model/rl78Disassemble.c
    [RL78_IT_3_X0_SET1     ] = rl78Dis_3_X0_SET1     ,
    [RL78_IT_3_X1_MOV1     ] = rl78Dis_3_X1_MOV1     ,
    [RL78_IT_3_X2_SET1     ] = rl78Dis_3_X2_SET1     ,
    [RL78_IT_3_X3_CLR1     ] = rl78Dis_3_X3_CLR1     ,
    [RL78_IT_3_X4_MOV1     ] = rl78Dis_3_X4_MOV1     ,
    [RL78_IT_3_X5_AND1     ] = rl78Dis_3_X5_AND1     ,
    [RL78_IT_3_X6_OR1      ] = rl78Dis_3_X6_OR1      ,
    [RL78_IT_3_X7_XOR1     ] = rl78Dis_3_X7_XOR1     ,
    [RL78_IT_3_X8_CLR1     ] = rl78Dis_3_X8_CLR1     ,
    [RL78_IT_3_X9_MOV1     ] = rl78Dis_3_X9_MOV1     ,
    [RL78_IT_3_XA_SET1     ] = rl78Dis_3_XA_SET1     ,
    [RL78_IT_3_XB_CLR1     ] = rl78Dis_3_XB_CLR1     ,
    [RL78_IT_3_XC_MOV1     ] = rl78Dis_3_XC_MOV1     ,
    [RL78_IT_3_XD_AND1     ] = rl78Dis_3_XD_AND1     ,
    [RL78_IT_3_XE_OR1      ] = rl78Dis_3_XE_OR1      ,
    [RL78_IT_3_XF_XOR1     ] = rl78Dis_3_XF_XOR1     ,
    [RL78_IT_3_7A_EI       ] = rl78Dis_3_7A_EI       ,
    [RL78_IT_3_7B_DI       ] = rl78Dis_3_7B_DI       ,
    [RL78_IT_3_80_SET1     ] = rl78Dis_3_80_SET1     ,
    [RL78_IT_3_88_CLR1     ] = rl78Dis_3_88_CLR1     ,
    [RL78_IT_3_C0_NOT1     ] = rl78Dis_3_C0_NOT1     ,
    [RL78_IT_3_Y1_MOV1     ] = rl78Dis_3_Y1_MOV1     ,
    [RL78_IT_3_Y2_SET1     ] = rl78Dis_3_Y2_SET1     ,
    [RL78_IT_3_Y3_CLR1     ] = rl78Dis_3_Y3_CLR1     ,
    [RL78_IT_3_Y4_MOV1     ] = rl78Dis_3_Y4_MOV1     ,
    [RL78_IT_3_Y5_AND1     ] = rl78Dis_3_Y5_AND1     ,
    [RL78_IT_3_Y6_OR1      ] = rl78Dis_3_Y6_OR1      ,
    [RL78_IT_3_Y7_XOR1     ] = rl78Dis_3_Y7_XOR1     ,
    [RL78_IT_3_Y9_MOV1     ] = rl78Dis_3_Y9_MOV1     ,
    [RL78_IT_3_YA_SET1     ] = rl78Dis_3_YA_SET1     ,
    [RL78_IT_3_YB_CLR1     ] = rl78Dis_3_YB_CLR1     ,
    [RL78_IT_3_YC_MOV1     ] = rl78Dis_3_YC_MOV1     ,
    [RL78_IT_3_YD_AND1     ] = rl78Dis_3_YD_AND1     ,
    [RL78_IT_3_YE_OR1      ] = rl78Dis_3_YE_OR1      ,
    [RL78_IT_3_YF_XOR1     ] = rl78Dis_3_YF_XOR1     ,

    [RL78_IT_4_X0_BTCLR    ] = rl78Dis_4_X0_BTCLR    ,
    [RL78_IT_4_X1_BTCLR    ] = rl78Dis_4_X1_BTCLR    ,
    [RL78_IT_4_X2_BT       ] = rl78Dis_4_X2_BT       ,
    [RL78_IT_4_X3_BT       ] = rl78Dis_4_X3_BT       ,
    [RL78_IT_4_X4_BF       ] = rl78Dis_4_X4_BF       ,
    [RL78_IT_4_X5_BF       ] = rl78Dis_4_X5_BF       ,
    [RL78_IT_4_X7_SHL      ] = rl78Dis_4_X7_SHL      ,
    [RL78_IT_4_X8_SHL      ] = rl78Dis_4_X8_SHL      ,
    [RL78_IT_4_X9_SHL      ] = rl78Dis_4_X9_SHL      ,
    [RL78_IT_4_XA_SHR      ] = rl78Dis_4_XA_SHR      ,
    [RL78_IT_4_XB_SAR      ] = rl78Dis_4_XB_SAR      ,
    [RL78_IT_4_Y0_BTCLR    ] = rl78Dis_4_Y0_BTCLR    ,
    [RL78_IT_4_Y1_BTCLR    ] = rl78Dis_4_Y1_BTCLR    ,
    [RL78_IT_4_Y2_BT       ] = rl78Dis_4_Y2_BT       ,
    [RL78_IT_4_Y3_BT       ] = rl78Dis_4_Y3_BT       ,
    [RL78_IT_4_Y4_BF       ] = rl78Dis_4_Y4_BF       ,
    [RL78_IT_4_Y5_BF       ] = rl78Dis_4_Y5_BF       ,
    [RL78_IT_4_XC_SHLW     ] = rl78Dis_4_XC_SHLW     ,
    [RL78_IT_4_XD_SHLW     ] = rl78Dis_4_XD_SHLW     ,
    [RL78_IT_4_XE_SHRW     ] = rl78Dis_4_XE_SHRW     ,
    [RL78_IT_4_XF_SARW     ] = rl78Dis_4_XF_SARW

};

static void fillInstructionBytes(rl78P rl78, Uns32 n, Uns32 thisPC, char *buf) {

    Uns32 i;
    Uns32 len = 0;

    // calculate size of skip instruction prefix
    Uns32 skipPrefixBytes = rl78->len_instByteAndSkip - rl78->len_instByte;

    // include prefix hex bytes
    thisPC -= skipPrefixBytes;

    for (i=0; i<rl78->len_instByteAndSkip; i++) {
        len += snprintf(&buf[len], (n - len), "%02x ", vmicxtFetch1Byte((vmiProcessorP)rl78, thisPC + i));
    }
}

static const char* skipPrefix(rl78P rl78) {

    if (rl78->skipCondition != en_Cond_T) {

        static const char *map[] = {
            [en_Cond_C]  = "SKC ; ",
            [en_Cond_NC] = "SKNC ; ",
            [en_Cond_H]  = "SKH ; ",
            [en_Cond_Z]  = "SKZ ; ",
            [en_Cond_NH] = "SKNH ; ",
            [en_Cond_NZ] = "SKNZ ; "
        };

        return map[rl78->skipCondition];

    } else {

        return "";
    }
}

//
// Default disassembler callback
//
static RL78_DISPATCH_FN(rl78DisDefault) {

    // get output buffer for disassembly
    char *result = (char *)userData;

    // default disassembly just shows instruction pattern
    sprintf(result, "??? instruction:0x%02x 0x%02x 0x%02x 0x%02x 0x%02x", instr[0], instr[1], instr[2], instr[3], instr[4]);
}

//
// RL78 disassembler
//
VMI_DISASSEMBLE_FN(rl78Disassemble) {

    // static buffer to hold disassembly result
    static char result[256];

    // disassemble, filling the result buffer
    rl78Decode((rl78P) processor, thisPC, &dispatchTable, rl78DisDefault, &result);

    // return the result
    return result;
}

